{
  "foodCategories": [
    {
      "categoryName": "Beverages",
      "description": "The food category of beverages encompasses a diverse array of liquid refreshments designed to quench thirst, enhance flavor, and provide a sensory experience. This category includes both non-alcoholic and alcoholic options, each with its own distinct characteristics and purposes. Non-alcoholic beverages include essentials like water, carbonated soft drinks, and freshly squeezed juices. They also encompass hot favorites like tea and coffee, both cherished for their rich flavors and caffeine content. Beyond these staples, you'll find a world of dairy-based creations like milkshakes and yogurt drinks, energizing sports beverages, and the vibrant medley of smoothies. In the realm of alcoholic beverages, you'll discover the craft and complexity of beer, the artistry of winemaking, and the diverse world of spirits and cocktails, each offering unique profiles and serving as delightful companions in various social and culinary settings. Beverage culture extends further into global specialties, from traditional mate in South America to the sweet indulgence of boba tea in Taiwan, showcasing the vast and colorful landscape of liquid nourishment. Whether it's a morning pick-me-up, a thirst quencher, or a celebratory toast, beverages play a pivotal role in our culinary adventures and daily lives.",
      "items": [
        "Cola",
        "Dr. Pepper",
        "Low Sodium Vegetable Juice",
        "Tomato Juice",
        "Beer",
        "White Wine",
        "Non-alcoholic Beer",
        "Water",
        "V8 Juice",
        "Sake",
        "Bourbon"
      ]
    },
    {
      "categoryName": "Dairy or Dairy Alternatives",
      "description": "The food category of Dairy and Dairy Alternatives encompasses a wide spectrum of products that provide rich sources of nutrients and culinary versatility. Traditional dairy products, such as milk, cheese, yogurt, and butter, are well-known for their creamy textures and distinctive flavors. These items are abundant sources of calcium, vitamin D, and protein, making them essential components of a balanced diet. In recent years, the demand for dairy alternatives has surged, offering options for those with lactose intolerance, dietary preferences, or ethical concerns. Plant-based milk alternatives, like almond, soy, and oat milk, have gained popularity, providing a dairy-free solution that can be used in cooking, baking, and as a beverage. Non-dairy yogurts, cheeses, and butter substitutes have also emerged, delivering a range of choices for those seeking alternatives to traditional dairy products. This diverse category offers a world of flavors and textures, allowing consumers to tailor their dairy and dairy-alternative choices to their personal tastes and dietary needs. Whether for the love of classic dairy or the embrace of innovative alternatives, this category satisfies both culinary requirements and lifestyle preferences.",
      "items": [
        "Coconut Milk",
        "Mozarella Cheese",
        "Cream Cheese",
        "Parmesan Cheese",
        "Cheddar Cheese",
        "Cheese",
        "Green Yogurt",
        "Strawberry Yogurt",
        "Blue Cheese Salad Dressing",
        "Pecan Ice Cream",
        "Mexican Cheese Blend",
        "Swiss Cheese",
        "Pepper Jack Cheese",
        "Smoked Gouda Cheese",
        "Provolone Cheese",
        "Evaporated Milk"
      ]
    },
    {
      "categoryName": "Eggs",
      "description": "The food category of eggs is a versatile and essential component of many cuisines worldwide. Eggs are a powerhouse of nutrients and culinary potential. They come in various forms, with the most common being chicken eggs. The egg white, or albumen, is rich in protein and low in fat, while the yolk contains healthy fats, vitamins, and minerals, including vitamin D, B vitamins, and choline. Eggs serve as a foundation for countless recipes, from classic breakfast dishes like scrambled eggs and omelets to baked goods like cakes, cookies, and custards. Eggs are often used as binders in recipes, helping to combine ingredients in dishes such as meatloaf or meatballs. They can be poached, boiled, or fried, offering diverse textures and flavors. Moreover, eggs are the base for iconic preparations like mayonnaise and hollandaise sauce. Beyond chicken eggs, there are various other types, including duck, quail, and even ostrich eggs, each with distinct flavors and sizes. Eggs are celebrated for their adaptability in the culinary world, making them a staple in households and professional kitchens alike. Whether providing the backbone to a meal or the finishing touch to a dessert, eggs are a fundamental ingredient in cooking and baking, offering an array of delightful culinary possibilities.",
      "items": ["Egg", "Salted Egg"]
    },
    {
      "categoryName": "Fats and Oils",
      "description": "The food category of fats and oils plays a pivotal role in the culinary world, as these substances provide flavor, texture, and functionality in a wide range of dishes. Fats, such as butter, lard, and margarine, are known for their ability to add richness and indulgence to recipes, from sautéed vegetables to flaky pastries. Oils, such as olive, canola, and coconut oil, are valued for their versatility in cooking and baking, each imparting its own unique aroma and taste to the finished dish. Fats and oils are a fundamental component of various cooking techniques, from frying and roasting to salad dressings and marinades. They also serve as carriers for fat-soluble vitamins and aid in the absorption of essential nutrients. In recent years, there has been a growing appreciation for the health benefits of certain oils, such as extra virgin olive oil, which is celebrated for its potential cardiovascular advantages. Fats and oils are not only essential for enhancing the sensory experience of food but are also integral to food preservation, with items like vegetable oils used in canning and pickling. Moreover, they are key ingredients in making iconic condiments like mayonnaise and sauces such as vinaigrettes. Whether contributing to the crispiness of fried chicken, the tenderness of a flaky pie crust, or the depth of flavor in a stir-fry, fats and oils are the unsung heroes of the culinary world, offering a world of possibilities in the kitchen and an intrinsic part of our daily diet.",
      "items": [
        "Coconut Oil",
        "Sesame Oil",
        "Canola Oil",
        "Cooking Oil",
        "Olive Oil",
        "Mayonnaise",
        "Cooking Spray",
        "Butter",
        "French-fried Onion"
      ]
    },
    {
      "categoryName": "Fish",
      "description": "The food category of fish is a diverse and highly regarded part of many culinary traditions worldwide. Fish is a significant source of high-quality protein, essential nutrients, and healthy fats. It encompasses a vast array of species, each with its own distinct flavor, texture, and culinary applications. From flaky white fish like cod and halibut to oily fish such as salmon, mackerel, and sardines, the variety of fish available offers a wide spectrum of tastes and cooking methods. Fish is cherished for its versatility in the kitchen, where it can be prepared in numerous ways, including baking, grilling, frying, steaming, or even enjoyed raw in dishes like sushi and sashimi. Its delicate flavor pairs well with a variety of seasonings, sauces, and accompaniments, making it a versatile ingredient that can be adapted to various cuisines and cooking styles. The consumption of fish is also associated with potential health benefits, as it is a rich source of omega-3 fatty acids, known for their positive impact on heart health and brain function. Moreover, fish offers an environmentally sustainable protein source, as many species can be sourced through responsible and eco-friendly fishing practices. From fish and chips in the United Kingdom to sushi in Japan, and ceviche in Peru to bouillabaisse in France, fish plays a central role in the culinary tapestry of numerous cultures. Whether grilled to perfection, gently poached, or served as the centerpiece of a seafood feast, fish is celebrated for its contribution to a wide range of delectable and nutritious dishes.",
      "items": [
        "Baby Octopus",
        "White Fish Fillet",
        "Fish Fillet",
        "White Fish",
        "Fish",
        "Mussel",
        "Calamari",
        "Tilapia Fillet",
        "Milkfish",
        "Canned Tomato Sauce Sardines",
        "Shrimp",
        "Canned Tuna",
        "Octopus",
        "Tuna",
        "Prawn",
        "Squid"
      ]
    },
    {
      "categoryName": "Fruits",
      "description": "The food category of fruits is a vibrant and essential part of our diet, celebrated for its natural sweetness, diverse flavors, and nutritional benefits. Fruits come in an astonishing array of colors, shapes, and sizes, making them a feast for the senses. These nature's jewels are a rich source of essential vitamins, minerals, fiber, and antioxidants, contributing to our overall well-being. From the succulent juiciness of tropical fruits like mangoes, pineapples, and papayas to the crispness of apples and pears, fruits offer a sensory experience that ranges from refreshing to indulgent. Berries, such as strawberries, blueberries, and raspberries, captivate our taste buds with their unique flavors and are often included in various desserts, breakfast dishes, and salads. Fruits are highly versatile in the culinary world. They can be enjoyed fresh, dried, or as components of smoothies, juices, and fruit salads. They also feature prominently in pies, tarts, jams, and preserves, adding a natural sweetness and vivid colors to these preparations. Fruits can be used to balance the savory elements of a dish, as seen in the combination of fruits with meats, or they can be the star attraction in vegetarian and vegan recipes. Beyond their delicious taste, fruits offer various health benefits. They are known for promoting digestive health, boosting the immune system, and aiding in weight management due to their low-calorie content and high fiber content. Fruits also serve as a delightful way to hydrate, especially in the form of natural fruit juices. Fruits are a cherished component of cultures worldwide, with each region showcasing its own favorites and unique preparations. Whether enjoyed as a refreshing snack, a vibrant side dish, or a luscious dessert, fruits are a universally appreciated and indispensable part of our culinary and dietary landscape.",
      "items": [
        "Apple",
        "Seedless Watermelon",
        "Lime Juice",
        "Lemon",
        "Banana",
        "Avocado",
        "Lemon Juice",
        "Frozen Orange Juice",
        "Grape Tomatoes",
        "Sun-dried Tomatoes",
        "Navel Orange",
        "Lemon Wedges",
        "Peach",
        "Pineapple"
      ]
    },
    {
      "categoryName": "Grains",
      "description": "The food category of grains is a cornerstone of diets worldwide, offering a diverse and essential source of sustenance. Grains are the edible seeds of grass-like plants and are cultivated for their valuable carbohydrates, fiber, and various vitamins and minerals. They provide a significant portion of the world's caloric intake and serve as the foundation for many staple foods. Common grains include wheat, rice, oats, barley, corn, and rye, each with distinct characteristics, textures, and flavors. Wheat, for instance, is used to make various bread and pasta products, while rice is a staple in many Asian and Latin American cuisines. Oats are favored for their heart-healthy benefits and are frequently used in breakfast dishes like oatmeal. Grains offer a world of culinary possibilities, from the comforting warmth of a bowl of risotto to the satisfying crunch of a freshly baked loaf of bread. They can be processed into flours for baking, transformed into cereals, or used to produce pasta, couscous, and a wide variety of grain-based dishes. Grains also serve as an important source of energy, with complex carbohydrates that release energy slowly over time, keeping us satiated and nourished. They are integral to vegetarian and vegan diets, providing vital nutrients like protein and iron. Cultures worldwide have unique grain-based staples, such as couscous in North Africa, quinoa in South America, and bulgur in the Middle East. These grains showcase the adaptability of this food category to local customs and culinary traditions. Grains are not only a culinary foundation but also play a vital role in addressing global food security and nourishing billions of people. Whether as a comforting bowl of rice, a hearty slice of bread, or a nutritious serving of quinoa, grains are a universally cherished and versatile category of food, contributing to the dietary and cultural richness of our world.",
      "items": [
        "Chicken Stuffing Mix",
        "Crackers",
        "Ramen Noodles",
        "Cheese Ravioli",
        "Shell Pasta",
        "Rice Pilaf Mix with Toasted Almonds",
        "Canned Biscuits",
        "Flour",
        "Bread",
        "Pasta",
        "Egg Noodles",
        "Grands Biscuit",
        "Fruity Pebbles Cereal",
        "Self-rising Flour",
        "Crescent Roll",
        "Tortilla",
        "Naan Flatbread",
        "Rice",
        "Tostada Shells",
        "Wheat Hamburger Buns",
        "Pretzel Rolls",
        "Hoagie Rolls"
      ]
    },
    {
      "categoryName": "Herbs and Spices",
      "description": "The food category of herbs and spices is a dazzling array of aromatic and flavorful enhancements that add depth, complexity, and character to a wide variety of dishes. Herbs are the leafy green parts of plants, while spices are typically derived from the seeds, bark, roots, or fruits of plants. Both are renowned for their abilities to elevate culinary creations, offering an enticing blend of tastes and aromas. Herbs, like basil, rosemary, and cilantro, bring a burst of freshness to a dish. They can be used fresh or dried, either to infuse subtle notes or as a dominant flavor, depending on the quantity and timing of their addition to recipes. Spices, on the other hand, encompass an exciting spectrum of tastes, from the fiery heat of chili pepper to the warm sweetness of cinnamon and the earthy richness of cumin. They add complexity, warmth, and zing to culinary creations. Some, like saffron and vanilla, are highly prized for their rarity and unique profiles. Herbs and spices have a profound impact on global cuisines. They are central to the vibrant curries of India, the robust flavors of Middle Eastern cuisine, the complex seasoning of Mexican dishes, and the delicate balance of French and Italian recipes. They are essential for marinades, rubs, sauces, soups, and stews, bringing an unparalleled sensory experience to each dish. Beyond their culinary attributes, herbs and spices have also been valued for their potential health benefits and medicinal uses. Many are rich in antioxidants and have been traditionally employed for their healing properties. In the culinary world, herbs and spices are like an artist's palette, allowing chefs and home cooks to craft a symphony of flavors and create memorable dining experiences. Whether used sparingly or with a generous hand, these seasonings are an indispensable category of food, transcending borders and cultures, and adding depth and character to the culinary landscape.",
      "items": [
        "Ground Ginger",
        "Hot Pepper Sauce",
        "Dijon Mustard",
        "Savory Pot Roast Seasoning Mix",
        "Sea Salt",
        "Mint",
        "Parsley",
        "French Onion Packet",
        "Ranch Seasoning",
        "Italian Dressing Mix",
        "Ranch Salad Dressing Mix",
        "Thyme",
        "Black Pepper",
        "Onion Soup Mix",
        "Salt",
        "Kosher Salt",
        "Taco Seasoning Mix",
        "Tanoori Chicken Masala",
        "Garlic",
        "Southwest-style Seasoning Blend",
        "Cornstarch",
        "Green Chili",
        "Sage",
        "Rosemary Sprigs",
        "Chili Powder",
        "Smoked Paprika",
        "Onion Seasoning",
        "Garlic Paste",
        "Seasoning",
        "Italian Seasoning",
        "Seasoned Salt"
      ]
    },
    {
      "categoryName": "Legumes",
      "description": "The food category of legumes represents a diverse group of plant-based foods that are not only a nutritional powerhouse but also play a crucial role in diets across the globe. Legumes include a wide variety of seeds, pods, or beans from the Fabaceae family of plants. They are celebrated for their high protein and fiber content, making them an excellent source of plant-based protein and essential nutrients. Common legumes encompass familiar favorites like lentils, chickpeas, black beans, and soybeans. Each type of legume offers a unique taste and texture, with applications in a wide range of culinary creations. Lentils, for instance, are known for their quick cooking time and versatility in soups, stews, and salads, while chickpeas shine in dishes like hummus and falafel. Soybeans are the primary source for tofu and other soy-based products, a cornerstone of many Asian cuisines. Legumes are appreciated for their ability to add hearty texture and depth to a wide variety of dishes. They are used as a base for vegetarian and vegan protein sources and are key components in plant-based diets. Their fiber content promotes digestive health, while their low fat content makes them a heart-healthy choice. Additionally, legumes are rich in vitamins, minerals, and antioxidants. Culturally, legumes are a significant part of many traditional cuisines. They feature prominently in dishes like dal in India, refried beans in Mexico, and bean stews in the Mediterranean, showcasing the adaptability of this food category to local customs and culinary traditions. Legumes are an essential dietary cornerstone for many, whether as a staple in daily meals or as a supplementary ingredient for health-conscious and environmentally conscious consumers. Their wide availability, versatility, and nutritional value make legumes an indispensable category of food, providing nourishment and a wide range of culinary possibilities.",
      "items": [
        "Great Northern Beans",
        "Black Beans",
        "Kidney Beans",
        "Miso Paste",
        "Canned Chili with Beans",
        "Refried Beans",
        "White Beans"
      ]
    },
    {
      "categoryName": "Meat",
      "description": "The food category of meat is a rich and diverse group of animal-derived products that have played a central role in human diets and culinary traditions for centuries. Meat provides a significant source of high-quality protein, essential vitamins, minerals, and fats. It encompasses a wide variety of cuts and types, with each offering distinct flavors and textures, depending on the animal source and the part of the animal. Common meats include beef, pork, poultry (such as chicken and turkey), and lamb, each with its own culinary applications. Beef, for instance, is known for its rich, savory taste and is used in a range of dishes from hearty stews to tender steaks. Pork is renowned for its versatility, finding its way into dishes like bacon, sausages, and roasts. Poultry is beloved for its lean protein content, making it a staple in dishes such as roast chicken and grilled turkey. Meat is prepared and enjoyed in a multitude of ways, from roasting, grilling, and braising to barbecuing and frying. It serves as the centerpiece in various international cuisines, from succulent American barbecue to classic French coq au vin. The consumption of meat can provide essential nutrients like iron, zinc, and vitamin B12. However, it is also a subject of discussions regarding health and environmental impacts, with a growing interest in alternative plant-based and lab-grown meat products as more sustainable and ethical options. Culturally, meat is often intertwined with traditions and celebrations. It plays a central role in holidays, feasts, and gatherings, reflecting its significance in bringing people together and marking special occasions. Meat is a fundamental and time-honored category of food, with a deep-rooted place in global culinary heritage. Whether as a star ingredient in a main course or as an accompaniment to enhance flavors, meat is celebrated for its diverse offerings and contributions to the richness of our diets and the art of cooking.",
      "items": [
        "Chicken Leg Quarter",
        "Chicken Drumstick",
        "Cooked Chicken",
        "Pork Leg",
        "Pork Loin",
        "Bulk Pork Sausage",
        "Round Beef Roast",
        "Beef Rump Roast",
        "Organic Beef",
        "Sausage Ravioli",
        "Beef Stir-fry Strips",
        "Bacon",
        "Pork Tenderloin",
        "Ham Steak",
        "Baked Ham",
        "Pork Chop",
        "Ground Spicy Pork Sausage",
        "Ground Pork Sausage",
        "Pot Roast",
        "Chuck Roast",
        "Beef Blade",
        "Meatball",
        "Ground Turkey",
        "Beef Stew Meat",
        "Ground Beef",
        "Chicken Breast",
        "Whole Chicken",
        "Prosciutto",
        "Chicken Wing",
        "Chicken Chunks",
        "Broiler Chicken",
        "Fryer Chicken",
        "Beef Mince",
        "Casserole Steak",
        "Beef Oxo",
        "Beef Top Sirloin",
        "Top Round Steak",
        "Flank Steak",
        "Pork Fillet",
        "Pork",
        "Pork Spare Ribs",
        "Pork Tenderloin",
        "Pork Shoulder Roast",
        "Ground Meatload Mixture",
        "Pork Loin Roast",
        "Beef Steak",
        "Meatloaf"
      ]
    },
    {
      "categoryName": "Nuts and Seeds",
      "description": "The food category of nuts and seeds is a nutritionally dense and versatile group of plant-based foods that have been a source of sustenance and culinary inspiration across cultures for centuries. Nuts are hard-shelled, edible fruits that do not split open to release their seeds, while seeds are the mature ovules of plants that are often found within the fruits. These bite-sized powerhouses are prized for their rich nutritional content, combining healthy fats, protein, fiber, vitamins, and minerals. Common nuts and seeds include almonds, walnuts, pecans, cashews, peanuts, sunflower seeds, pumpkin seeds, chia seeds, and flaxseeds. Each type offers a distinct flavor and texture, making them adaptable for various culinary applications. Almonds, for example, are celebrated for their mild, nutty flavor and are often enjoyed as a snack, added to salads, or ground into almond flour for baking. Chia seeds, on the other hand, are renowned for their impressive omega-3 fatty acid content and ability to form a gel-like consistency when mixed with liquids, making them ideal for puddings, smoothies, or as an egg substitute in vegan baking. Nuts and seeds are incorporated into a wide range of dishes, from trail mixes and granolas to baked goods, sauces, and dressings. They can be enjoyed on their own as a nutritious snack or sprinkled on top of yogurt, oatmeal, or salads to add texture and flavor. These nutrient-packed foods have gained recognition for their potential health benefits, including heart health, weight management, and their role in a balanced diet. Their monounsaturated and polyunsaturated fats provide essential fatty acids, while their fiber content supports digestive health. Culturally, nuts and seeds have been used in both sweet and savory dishes around the world. They are central to Middle Eastern sweets like baklava, as well as the essential ingredients in the Mexican mole sauce. They are also a symbol of hospitality and a favorite treat during festive occasions. Nuts and seeds are a beloved category of food that seamlessly combines taste, nutrition, and versatility. Whether as a crunchy topping, a creamy nut butter, or a flavorful component in both everyday and special-occasion recipes, they are essential in our culinary heritage and dietary choices.",
      "items": [
        "Unsalted Dry Roasted Peanut",
        "Sesame Seeds",
        "Pine Nuts",
        "Sunflower Seeds",
        "Almonds"
      ]
    },
    {
      "categoryName": "Sauces and Condiments",
      "description": "The food category of sauces and condiments is a dynamic and flavor-enhancing array of culinary companions that add depth, complexity, and excitement to a wide range of dishes. Sauces are typically liquid or semi-liquid creations, often served hot or cold, while condiments are various seasonings, garnishes, or accompaniments that intensify the taste of other foods. These additions offer a burst of unique flavors, a kick of spice, or a balance of sweetness, transforming ordinary meals into extraordinary culinary experiences. Common sauces include tomato sauce, bechamel, and hollandaise, each bringing its distinct character to a dish. Tomato sauce is celebrated for its rich, tangy taste and serves as a versatile base for pasta, pizza, and many Italian dishes. Bechamel, a white sauce, provides a creamy, velvety texture and is essential in dishes like lasagna and macaroni and cheese. Hollandaise sauce is renowned for its buttery, lemony flavor and is often drizzled over eggs Benedict or asparagus. Condiments, on the other hand, range from classic ketchup and mustard to exotic chutneys and pickles. These items offer a delightful pop of flavor and texture to sandwiches, hot dogs, burgers, and various other dishes. Mustard, for instance, is cherished for its pungent kick, while chutneys, with their mix of fruits and spices, are a delightful addition to Indian cuisine. Sauces and condiments play a vital role in the world of cuisine, enhancing both the savory and sweet aspects of food. They offer creative avenues for exploration, allowing chefs and home cooks to customize and personalize dishes to suit their preferences. They can balance, contrast, or complement flavors, providing a nuanced and multi-layered culinary experience. Culturally, sauces and condiments are integral to various regional dishes and are often passed down through generations, carrying the tradition and identity of different culinary heritages. From the zesty salsa of Mexico to the tangy tzatziki of Greece, these enhancements reflect the diversity and creativity of global cuisine. Sauces and condiments are an essential category of food, elevating meals from the ordinary to the extraordinary and adding a touch of culinary artistry to the dining experience. Whether used sparingly or generously, they have a profound influence on the sensory delights of the table.",
      "items": [
        "Caesar Salad Dressing",
        "Worcestershire Sauce",
        "Cider Vinegar",
        "Taco Sauce",
        "Sweet Chili Sauce",
        "Sweet Pickled Relish",
        "Soy Sauce",
        "Spaghetti Sauce",
        "Seasoned Bread Crumbs",
        "Vegatable Stock",
        "Pesto Sauce",
        "Italian Salad Dressing",
        "Asian Sesame Salad Dressing",
        "Alfredo Sauce",
        "Salsa Verde",
        "Chicken Stock",
        "White Vinegar",
        "Basil Pesto",
        "Beef Stock",
        "Yellow Mustard",
        "Ketchup",
        "Buffalo Wing Sauce",
        "Barbeque Sauce",
        "Salsa",
        "Chunky Salsa",
        "Croutons",
        "Marinara Sauce",
        "Tomato Sauce",
        "Pesto",
        "Rice Vinegar",
        "Apple Cider Vinegar",
        "Teriyaki Sauce",
        "Original Sloppy Joe Sauce",
        "Pasta Sauce",
        "Caesar Dressing",
        "Ginger Sauce",
        "Hoisin Sauce",
        "Sriracha Chili Sauce",
        "Mango Chutney",
        "Bread Crumbs"
      ]
    },
    {
      "categoryName": "Soup",
      "description": "The food category of soup is a warm and comforting culinary tradition enjoyed worldwide. Soups are versatile and nourishing dishes that consist of a liquid base, often flavored with a combination of vegetables, proteins, grains, and seasonings. They come in countless variations, each with its unique character and cultural significance. Common types of soup include chicken noodle soup, minestrone, miso soup, and tomato bisque, among many others. Each variety has its own distinct flavor profile and ingredients. Chicken noodle soup, for example, is celebrated for its soothing properties and is often associated with comfort and healing. Minestrone is a hearty Italian soup, rich in vegetables and beans, while miso soup is a staple in Japanese cuisine, typically featuring a savory broth flavored with fermented soybean paste. Tomato bisque is known for its creamy and tomato-rich base, perfect for pairing with a grilled cheese sandwich. Soups offer a world of culinary possibilities, from hearty stews and broths to creamy bisques and clear consommés. They are often served as appetizers, side dishes, or main courses, catering to a wide range of dietary preferences and occasions. Soups can be simple and rustic or elaborate and gourmet, making them a versatile addition to the dining table. Beyond their satisfying taste, soups are cherished for their nourishing qualities. They provide a comforting and filling meal, making them perfect for cold winter days or when under the weather. The combination of vegetables, proteins, and grains in many soups also results in a balanced and nutritious option. Culturally, soups hold a significant place in the culinary traditions of various regions and are often steeped in history and symbolism. They are associated with family gatherings, religious ceremonies, and traditional celebrations. Soups are an essential category of food that offers warmth, comfort, and a timeless connection to the past. Whether as a quick and easy weeknight meal or as a labor of love prepared for special occasions, soups are celebrated for their ability to nourish both body and soul.",
      "items": [
        "Cream of Condensed Broccoli Cheese Soup",
        "Golden Mushroom Soup",
        "Bone Broth",
        "Tomato Soup",
        "Cream of Condensed Mushroom Soup",
        "Cream of Condensed Chicken Soup",
        "Chicken Broth",
        "Beef Broth",
        "Tomato Rice Soup",
        "Onion Soup",
        "Mushroom Soup",
        "Sherry Broth"
      ]
    },
    {
      "categoryName": "Sweets and Sugars",
      "description": "The food category of sweets and sugars is a delectable world of confections, desserts, and sweeteners that add joy and indulgence to our lives. Sweets encompass a wide variety of treats, from chocolate and candies to pastries and ice cream. Sugars, on the other hand, include both natural sugars found in fruits and honey, as well as processed sugars like granulated sugar and high-fructose corn syrup, used to sweeten a plethora of foods and beverages. Common sweets include chocolate bars, gummy candies, cupcakes, and fruit pies, each offering a unique blend of flavors, textures, and sweetness levels. Chocolate is celebrated for its rich, velvety texture and the harmony of bitter and sweet notes, while gummy candies provide chewy, fruit-flavored delights. Cupcakes are miniature, portable cakes, often adorned with creamy frosting and decorations. Fruit pies feature flaky crusts and vibrant fillings, with classics like apple and cherry. Sweets and sugars play a vital role in celebratory occasions, special moments, and everyday indulgences. They offer comfort, reward, and an exquisite sensory experience, making them a source of delight for people of all ages. They can be a source of nostalgia, taking us back to cherished childhood memories or cultural traditions. Culturally, sweets and sugars are an integral part of various holidays and festivities, from the exchange of chocolate on Valentine's Day to the colorful display of candies during Halloween. They also hold a significant place in religious rituals and traditions, such as the sharing of desserts during Eid al-Fitr in Islam or the consumption of honey and apples on Rosh Hashanah in Judaism. Sweets and sugars are not only associated with joy and celebration but also scrutinized for their impact on health, contributing to ongoing discussions about moderation and dietary choices. As a result, there is a growing interest in alternatives and reduced-sugar options to accommodate various preferences and dietary needs. Sweets and sugars, whether simple or elaborate, reflect the universal human desire for sweetness and pleasure. They serve as a comforting treat, a symbol of hospitality, and a testament to the artistry of baking and confectionery. Whether enjoyed as an occasional treat or an everyday indulgence, sweets and sugars add a touch of sweetness to life's moments.",
      "items": [
        "Red Jalapeno Pepper Jelly",
        "Apricot Preserve",
        "Grape Jelly",
        "Maple Syrup",
        "Sugar",
        "Honey",
        "Brown Sugar",
        "Agave Nectar"
      ]
    },
    {
      "categoryName": "Tofu and Tempeh",
      "description": "The food category of tofu and tempeh represents a versatile and nutritious group of plant-based protein sources, originating from soybeans and commonly used in a variety of global cuisines. Both tofu and tempeh are prized for their capacity to absorb flavors, adapt to various cooking methods, and offer a substantial source of protein for those following vegetarian, vegan, or flexitarian diets. Tofu, also known as bean curd, is created by coagulating soy milk and then pressing the resulting curds into a solid form. It is available in various textures, from silken and soft to extra-firm. Silken tofu is often used in smoothies, desserts, and soups, while firmer varieties are suitable for grilling, stir-frying, and sautéing. Tofu is celebrated for its ability to take on the flavors of the dishes it is incorporated into, making it a versatile ingredient in both savory and sweet preparations. Common dishes featuring tofu include tofu stir-fries, tofu scrambles, and silken tofu-based desserts. Tempeh is a traditional Indonesian soybean product that is made by fermenting cooked and dehulled soybeans with a specific mold. This fermentation process results in a dense, nutty, and slightly earthy product with a firm texture. Tempeh is commonly used in plant-based diets as a protein source and can be sliced, marinated, and grilled, or crumbled and used as a ground meat substitute. It is renowned for its nutty flavor and is often used in dishes such as tempeh stir-fries, sandwiches, and salads. Both tofu and tempeh are celebrated for their nutritional profile. They are rich in protein, low in saturated fats, and provide essential nutrients such as iron, calcium, and B vitamins. These plant-based alternatives have gained popularity due to their potential health benefits, including heart health and weight management. Culturally, tofu and tempeh have deep roots in Asian cuisine, where they have been consumed for centuries. These ingredients have also gained popularity in the West as versatile and sustainable sources of plant-based protein, catering to diverse culinary preferences and dietary choices. Tofu and tempeh are essential components of plant-based diets, offering a world of culinary possibilities and nutritional benefits. Whether used as a base for savory dishes or integrated into sweet treats, they continue to be a favored choice for those seeking alternatives to traditional animal-based proteins.",
      "items": ["Tofu"]
    },
    {
      "categoryName": "Vegetables",
      "description": "The food category of vegetables is a vibrant and essential group of plant-based foods that provides a multitude of flavors, colors, and nutrients to our diets. Vegetables are the edible parts of plants, often consumed for their unique taste, culinary versatility, and health benefits. They come in a wide variety of forms, including leafy greens, root vegetables, cruciferous vegetables, and more. Common vegetables include staples like tomatoes, carrots, broccoli, and spinach, each offering a distinctive combination of flavors and nutritional value. Tomatoes are known for their juicy, sweet-tart taste and are used in everything from salads to pasta sauces. Carrots are loved for their crunchy texture and natural sweetness, making them a favored choice for snacking and salads. Broccoli is celebrated for its earthy flavor and is often steamed or roasted as a side dish. Spinach, with its tender leaves, is a versatile green used in salads, smoothies, and various cooked dishes. Vegetables serve as the foundation of many dishes and offer a multitude of culinary possibilities. They can be eaten raw, steamed, roasted, grilled, stir-fried, or incorporated into soups, stews, and casseroles. Vegetables also contribute a wealth of essential vitamins, minerals, dietary fiber, and antioxidants to the diet, promoting overall health and well-being. Culturally, vegetables are central to the culinary traditions of numerous regions, and they often reflect local customs, seasonal availability, and regional preferences. The Mediterranean diet emphasizes the use of vegetables like tomatoes, olives, and eggplant, while Asian cuisine showcases a vast array of vegetables in stir-fries, curries, and sushi. Vegetables are cherished not only for their taste but also for their potential health benefits, including supporting weight management, reducing the risk of chronic diseases, and providing essential nutrients like vitamin C, vitamin K, and potassium. Whether as the stars of vegetarian and vegan dishes, the vibrant accompaniments to proteins, or the key ingredients in salads and side dishes, vegetables are a dietary cornerstone. Their role in enhancing the sensory experience of food, promoting health, and reflecting cultural diversity makes them an indispensable and cherished food category.",
      "items": [
        "Green Onion",
        "Green Leafy Vegetables",
        "Stew Vegetables",
        "Zucchini",
        "Red Capsicum",
        "Tater Tots",
        "Green Beans",
        "Squash",
        "Carrot",
        "Portobello Mushrooms",
        "Peas",
        "Eggplant",
        "Bell Pepper",
        "Butternut Pumpkin",
        "Potato",
        "Corn",
        "Broccoli",
        "Mixed Veggies",
        "String Beans",
        "Onion",
        "Sweet Potato",
        "Cauliflower",
        "Acorn Squash",
        "Fajita Vegetables",
        "Kale",
        "Baby Spinach",
        "Chickpeas",
        "Brussels Sprout",
        "Mixed Greens",
        "Spinach",
        "Tomato",
        "Hash Brown",
        "Mashed Potato",
        "Stir-fried Vegetables",
        "Russet Potato",
        "Romaine Lettuce",
        "Ginger",
        "Calamansi Juice",
        "Pepper Leaves",
        "Green Leavy Vegetables",
        "Mushroom",
        "Vegetables"
      ]
    }
  ],

  "recipeList": [
    {
      "items": ["Butter", "Salt", "Chicken Breast"],
      "recipeName": "Baked Chicken Breasts",
      "ingredients": [
        "1/4 cup of melted butter",
        "1 tsp. salt",
        "4 skinless and boneless breasts, halves"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Preheat the oven to 350 degrees F (175 degrees C). Lightly butter a baking dish."
        },
        {
          "step2": "Stir together melted butter and salt in a bowl."
        },
        {
          "step3": "Arrange chicken in the prepared baking dish. Brush butter mixture onto chicken until thoroughly coated, pouring any extra over chicken."
        },
        {
          "step4": "Bake in the preheated oven until no longer pink in the center and juices run clear, 30 to 45 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
        }
      ]
    },
    {
      "items": ["Whole Chicken", "Lemon", "Kosher Salt"],
      "recipeName": "Ridiculously Simple Roast Chicken",
      "ingredients": [
        "(1) 4 pound rinsed whole chicken",
        "1 lemon, halved",
        "Kosher salt"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/228848/stupid-simple-roast-chicken/",
      "steps": [
        {
          "step1": "Preheat the oven to 450 degrees F (230 degrees C)."
        },
        {
          "step2": "Place chicken into a roasting pan and insert lemon halves into the cavity; spread kosher salt over the outside of the chicken."
        },
        {
          "step3": "Roast in the preheated oven until skin is browned and crisp, the juices run clear, and an instant-read meat thermometer inserted into the thickest part of a thigh, not touching bone, reads 160 degrees F (70 degrees C), about 1 hour. Let chicken rest for 15 minutes before carving."
        }
      ]
    },
    {
      "items": ["Chicken Breast", "Basil Pesto", "Prosciutto"],
      "recipeName": "Pesto Chicken",
      "ingredients": [
        "4 skinless and boneless chicken breasts, halves",
        "1/2 cup divided basil pesto",
        "4 thin slices of prosciutto (or more if needed)"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/214188/pesto-chicken/",
      "steps": [
        {
          "step1": "Preheat oven to 400 degrees F (200 degrees C). Grease a baking dish."
        },
        {
          "step2": "Spread about 2 tablespoons of pesto per chicken breast over the top of each breast, and wrap each breast in prosciutto slices to cover the entire breast. Place the wrapped chicken breasts into the prepared baking dish."
        },
        {
          "step3": "Bake in the preheated oven until the chicken is no longer pink, the juices run clear, and the prosciutto is lightly crisped, about 25 minutes."
        }
      ]
    },
    {
      "items": ["Onion", "Whole Chicken", "Salt"],
      "recipeName": "Chef John's Broiled Chicken",
      "ingredients": [
        "1 sliced, small onion",
        "(1) 3 pound whole chicken, cut in half and backbone removed",
        "Salt as needed"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/238923/chef-johns-broiled-chicken/",
      "steps": [
        {
          "step1": "Preheat the oven broiler. Set an oven rack about 7 to 8 inches from the heat source."
        },
        {
          "step2": "Spread onion slices in a single layer on the bottom of a baking dish. Season chicken with salt. Place chicken halves skin-side down over onion rings."
        },
        {
          "step3": "Cook chicken in the preheated oven, turning every 7 minutes, until caramelized, no longer pink at the bone, and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 165 degrees F (74 degrees C)."
        }
      ]
    },
    {
      "items": ["Chicken Broth", "Taco Seasoning Mix", "Chicken Breast"],
      "recipeName": "Fiesta Slow Cooker Shredded Chicken Tacos",
      "ingredients": [
        "1 cup chicken broth",
        "3 tbsp. taco seasoning mix",
        "1 pound skinless and boneless chicken breasts"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/242342/fiesta-slow-cooker-shredded-chicken-tacos/",
      "steps": [
        {
          "step1": "Combine chicken broth and taco seasoning mix in a bowl."
        },
        {
          "step2": "Place chicken in a slow cooker. Pour chicken broth mixture over chicken."
        },
        {
          "step3": "Cook on Low for 6 to 8 hours. Shred chicken."
        }
      ]
    },
    {
      "items": ["Chicken Wing", "Barbeque Sauce", "Maple Syrup"],
      "recipeName": "3-Ingredient Baked BBQ Chicken Wings",
      "ingredients": [
        "5 pounds frozen chicken wings, thawed",
        "10 fluid ounces barbeque sauce",
        "2 tablespoons maple-flavored syrup"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/256355/3-ingredient-baked-bbq-chicken-wings/",
      "steps": [
        {
          "step1": "Gather all ingredients. Place wings in a large bowl."
        },
        {
          "step2": "Preheat oven to 425 degrees F (220 degrees C)."
        },
        {
          "step3": "Mix barbecue sauce and syrup together, then pour over wings and toss to coat. Arrange coated wings on a baking tray."
        },
        {
          "step4": "Bake in the preheated oven, flipping every 15 to 20 minutes, for 1 hour. Turn on oven's broiler and broil wings until golden brown, about 5 minutes per side. An instant-read thermometer inserted near the bone should read at least 165 degrees F (74 degrees C)."
        },
        {
          "step5": "Serve hot and enjoy!"
        }
      ]
    },
    {
      "items": ["Onion", "Whole Chicken", "Salsa"],
      "recipeName": "Slow Cooker Chicken and Salsa",
      "ingredients": [
        "1 sweet onion, sliced and separated into rings",
        "1 (5 pound) whole chicken",
        "1 (20 ounce) jar salsa"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/237682/slow-cooker-chicken-and-salsa/",
      "steps": [
        {
          "step1": "Spread onion rings into the bottom of a slow cooker crock. Place chicken onto onion layer with breast-side facing down. Pour salsa over the chicken."
        },
        {
          "step2": "Cook on High until no longer pink at the bone and the juices run clear, about 5 hours. An instant-read thermometer inserted into the thickest part of the thigh near the bone should read 165 degrees F (74 degrees C)."
        },
        {
          "step3": "Remove the chicken from slow cooker, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area for 10 minutes before cutting."
        }
      ]
    },
    {
      "items": ["Onion", "Chicken Egg", "Chicken Breast"],
      "recipeName": "Crunchy French Onion Chicken",
      "ingredients": [
        "1 ⅓ cups French-fried onions, crushed",
        "1 large egg, beaten",
        "1 pound skinless, boneless chicken breast halves"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239896/crunchy-french-onion-chicken/",
      "steps": [
        {
          "step1": "Gather all ingredients."
        },
        {
          "step2": "Preheat the oven to 400 degrees F (200 degrees C)."
        },
        {
          "step3": "Spread crushed onions in a shallow bowl. Pour egg into a separate shallow bowl."
        },
        {
          "step4": "Dip chicken into beaten egg, then press into crushed onions. Gently tap chicken to let loose pieces fall away. Place breaded chicken on a baking sheet."
        },
        {
          "step5": "Bake chicken until no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
        }
      ]
    },
    {
      "items": ["Sweet Potato", "Chicken Breast", "Barbeque Sauce"],
      "recipeName": "3-Ingredient BBQ Stuffed Sweet Potatoes",
      "ingredients": [
        "2 medium sweet potatoes, halved",
        "1 lb. boneless skinless chicken breasts, cooked and shredded",
        "1/3 cup BBQ sauce, your favorite (or less/more, to your taste)"
      ],
      "websiteLink": "https://www.thecomfortofcooking.com/2014/10/3-ingredient-bbq-chicken-stuffed-sweet-potatoes.html",
      "steps": [
        {
          "step1": "Preheat oven to 425 degrees F. Lay sweet potatoes cut side up on a large baking sheet. Roast until tender, about 35 minutes, depending on size of your potatoes."
        },
        {
          "step2": "In a saucepan set to medium-low, stir together chicken and BBQ sauce. Heat until warm, 5-10 minutes."
        },
        {
          "step3": "Top each potato with scoopfuls of chicken. Spoon over additional BBQ sauce and sprinkle with chopped parsley or sliced green onions, if desired."
        }
      ]
    },
    {
      "items": ["Chicken Chunks", "Tanoori Chicken Masala", "Green Yogurt"],
      "recipeName": "Grilled Chicken",
      "ingredients": [
        "500 gms Chicken Chunks",
        "1 tsp Tandoori Chicken Masala",
        "1/2 cup Green yogurt"
      ],
      "websiteLink": "https://food.ndtv.com/recipe-3-ingredients-grilled-chicken-955919",
      "steps": [
        {
          "step1": "Wash chicken chunks and pat them dry before marinating."
        },
        {
          "step2": "In a bowl, add curd that has been hung for at least 15 minutes and then add tandoori masala to it."
        },
        {
          "step3": "Mix everything together properly and let this marinate for a minimum of an hour."
        },
        {
          "step4": "Once done, heat a thick bottomed pan and roast the chicken chunks in medium-high flame for 15 minutes each on both sides."
        },
        {
          "step5": "You may brush the chicken chunks with ghee for that extra glossy look."
        },
        {
          "step6": "Serve with mint chutney and enjoy!"
        }
      ]
    },
    {
      "items": ["Strawberry Yogurt", "Fruity Pebbles Cereal", "Banana"],
      "recipeName": "Frozen Banana Cereal Pops",
      "ingredients": [
        "3/4 cup strawberry yogurt",
        "2 cups Fruity Pebbles cereal",
        "4 medium bananas"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/frozen-banana-cereal-pops/",
      "steps": [
        {
          "step1": "Place yogurt and cereal in separate shallow bowls."
        },
        {
          "step2": "Insert pop sticks through cut side of bananas."
        },
        {
          "step3": "Dip bananas in yogurt, then roll in cereal to coat."
        },
        {
          "step4": "Transfer to waxed paper-lined baking sheets."
        },
        {
          "step5": "Freeze until firm, about 1 hour."
        },
        {
          "step6": "Transfer to airtight freezer containers; seal containers and return pops to freezer."
        }
      ]
    },
    {
      "items": [
        "Cauliflower",
        "Buffalo Wing Sauce",
        "Blue Cheese Salad Dressing"
      ],
      "recipeName": "Roasted Buffalo Cauliflower Bites",
      "ingredients": [
        "1 medium head cauliflower",
        "1/2 cup Buffalo wing sauce",
        "Blue cheese salad dressing"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/roasted-buffalo-cauliflower-bites/",
      "steps": [
        {
          "step1": "Preheat oven to 400°."
        },
        {
          "step2": "Toss cauliflower with oil; spread in a 15x10x1-in. pan."
        },
        {
          "step3": "Roast until tender and lightly browned, 20-25 minutes, stirring once."
        },
        {
          "step4": "Transfer to a bowl; toss with wing sauce."
        },
        {
          "step5": "Serve with dressing."
        }
      ]
    },
    {
      "items": ["Pecan Ice Cream", "Self-rising Flour", "Sugar"],
      "recipeName": "Ice Cream Bread",
      "ingredients": [
        "1 cup butter pecan ice cream",
        "3/4 cup self-rising flour",
        "1 tablespoon sugar"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/ice-cream-bread/",
      "steps": [
        {
          "step1": "In a small bowl, combine the ice cream, self-rising flour and sugar."
        },
        {
          "step2": "Transfer to a 5-3/4x3x2-in. loaf pan coated with cooking spray."
        },
        {
          "step3": "Bake at 350° for 30-35 minutes or until a toothpick inserted in the center comes out clean."
        },
        {
          "step4": "Cool for 10 minutes before removing from pan to a wire rack."
        }
      ]
    },
    {
      "items": ["Crescent Roll", "Onion", "Chicken Egg"],
      "recipeName": "Easy Onion Crescent Rolls",
      "ingredients": [
        "1 tube refrigerated crescent rolls",
        "1-1/3 cups french-fried onions",
        "1 large egg"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/easy-onion-crescent-rolls/",
      "steps": [
        {
          "step1": "Unroll crescent dough and separate into triangles."
        },
        {
          "step2": "Sprinkle each with about 2 tablespoons onions."
        },
        {
          "step3": "Roll up each from the wide end; place on an ungreased foil-lined baking sheet."
        },
        {
          "step4": "Curve ends down to form crescents."
        },
        {
          "step5": "Beat the egg and water; brush over dough."
        },
        {
          "step6": "Sprinkle with remaining onions."
        },
        {
          "step7": "Bake at 400° until golden brown, 10-12 minutes."
        },
        {
          "step8": "Serve warm."
        }
      ]
    },
    {
      "items": ["Tortilla", "Mexican Cheese Blend", "Salsa"],
      "recipeName": "Cheesy Quesadillas",
      "ingredients": [
        "4 flour tortillas",
        "1-1/2 cups shredded Mexican cheese blend",
        "1/2 cup salsa"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/cheesy-quesadillas/",
      "steps": [
        {
          "step1": "Place the tortillas on a greased baking sheet."
        },
        {
          "step2": "Combine the cheese and salsa; spread over half of each tortilla."
        },
        {
          "step3": "Fold tortilla over."
        },
        {
          "step4": "Broil 4 in. from the heat for 3 minutes on each side or until golden brown."
        },
        {
          "step5": "Cut into wedges."
        }
      ]
    },
    {
      "items": ["Avocado", "Lemon Juice", "Chunky Salsa"],
      "recipeName": "Simple Guacamole",
      "ingredients": [
        "2 medium ripe avocados",
        "1 tablespoon lemon juice",
        "1/4 cup chunky salsa"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/simple-guacamole/",
      "steps": [
        {
          "step1": "Peel and chop avocados; place in a small bowl."
        },
        {
          "step2": "Sprinkle with lemon juice."
        },
        {
          "step3": "Add salsa and salt; mash coarsely with a fork."
        },
        {
          "step4": "Refrigerate until serving."
        }
      ]
    },
    {
      "items": ["Butter", "Garlic", "Naan Flatbread"],
      "recipeName": "Grilled Garlic Naan",
      "ingredients": [
        "2 tablespoons butter",
        "3 garlic cloves, minced",
        "2 naan flatbreads"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/grilled-garlic-naan/",
      "steps": [
        {
          "step1": "Stir butter and garlic together."
        },
        {
          "step2": "Place naan on grill rack; grill over medium-high heat until bottom is golden brown, about 2 minutes."
        },
        {
          "step3": "Flip and brush top with garlic butter."
        },
        {
          "step4": "Grill until golden brown on bottom."
        },
        {
          "step5": "Remove; cut each naan in half."
        }
      ]
    },
    {
      "items": ["Unsalted Dry Roasted Peanut", "Salt", "Honey"],
      "recipeName": "Homemade Peanut Butter",
      "ingredients": [
        "2 cups unsalted dry roasted peanuts",
        "1/2 teaspoon salt",
        "1 tablespoon honey"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/homemade-peanut-butter/",
      "steps": [
        {
          "step1": "Process peanuts and salt in a food processor until desired consistency, about 5 minutes, scraping down side as needed."
        },
        {
          "step2": "Add honey; process just until blended."
        },
        {
          "step3": "Store in an airtight container in refrigerator."
        }
      ]
    },
    {
      "items": ["Acorn Squash", "Brown Sugar", "Butter"],
      "recipeName": "Candied Acorn Squash Slices",
      "ingredients": [
        "2 medium acorn squash",
        "2/3 cup packed brown sugar",
        "1/2 cup butter, softened"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/candied-acorn-squash-slices/",
      "steps": [
        {
          "step1": "Preheat oven to 350°."
        },
        {
          "step2": "Cut squash in half lengthwise; remove and discard seeds."
        },
        {
          "step3": "Cut each half crosswise into 1/2-in. slices; discard ends."
        },
        {
          "step4": "Arrange squash in a shallow baking pan; cover with foil."
        },
        {
          "step5": "Bake until just tender, 25-30 minutes."
        },
        {
          "step6": "Combine sugar and butter; spread over squash."
        },
        {
          "step7": "Bake, uncovered, 15-20 minutes longer, basting occasionally."
        }
      ]
    },
    {
      "items": ["Chunky Salsa", "Rice", "Cheese"],
      "recipeName": "Salsa Rice",
      "ingredients": [
        "1-1/2 cups chunky salsa",
        "2 cups uncooked instant rice",
        "1 to 1-1/2 cups shredded cheese"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/salsa-rice/",
      "steps": [
        {
          "step1": "In a saucepan, bring water and salsa to a boil."
        },
        {
          "step2": "Stir in rice."
        },
        {
          "step3": "Remove from the heat; cover and let stand for 5 minutes."
        },
        {
          "step4": "Stir in cheese; cover and let stand for 30 seconds or until cheese is melted."
        }
      ]
    },
    {
      "items": ["Ground Beef", "Onion", "Tomato Rice Soup"],
      "recipeName": "Cheesy Beef Enchilada Dip",
      "ingredients": [
        "1 lb lean ground beef (Meat)",
        "1 medium onion",
        "10 ounces tomato rice soup "
      ],
      "websiteLink": "https://www.theslowroasteditalian.com/cheesy-beef-enchilada-dip-recipe",
      "steps": [
        {
          "step1": "In a large skillet or frying pan, cook the lean ground beef over medium-high heat."
        },
        {
          "step2": "Break it into small pieces using a spatula as it cooks."
        },
        {
          "step3": "Cook until the beef is browned and no longer pink."
        },
        {
          "step4": "Make sure to drain any excess fat if necessary."
        },
        {
          "step5": "Add the finely chopped onion to the cooked beef and sauté for a few minutes until the onion becomes translucent and fragrant. This will add flavor to the dip."
        },
        {
          "step6": "Once the beef and onion are cooked, reduce the heat to low and pour in the 10 ounces of tomato rice soup."
        },
        {
          "step7": "Stir the soup into the beef and onion mixture until it's well combined."
        },
        {
          "step8": "Let the mixture simmer for a few minutes, allowing the flavors to meld together."
        },
        {
          "step9": "Stir occasionally to prevent sticking."
        },
        {
          "step10": "If you want your dip to be extra cheesy, you can optionally add a handful of shredded cheese at this point. Cheddar or Mexican blend cheese would work well."
        },
        {
          "step11": "Continue to cook the dip until it's heated through and any added cheese is melted and creamy. This should take about 5-7 minutes."
        },
        {
          "step12": "Once the dip is heated and well-mixed, transfer it to a serving dish."
        },
        {
          "step13": "You can optionally garnish it with more shredded cheese or chopped fresh cilantro for added flavor and presentation."
        },
        {
          "step14": "Serve the Cheesy Beef Enchilada Dip with tortilla chips or slices of toasted baguette. Enjoy!"
        }
      ]
    },
    {
      "items": ["Beef Stew Meat", "Butter", "Onion Soup Mix"],
      "recipeName": "Butter Beef",
      "ingredients": [
        "3 pounds cubed beef stew meat",
        "½ cup butter",
        "1 (1 ounce) envelope dry onion soup mix"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/73910/butter-beef/",
      "steps": [
        {
          "step1": "Gather all ingredients."
        },
        {
          "step2": "Place beef and butter in a slow cooker and sprinkle onion soup mix over top."
        },
        {
          "step3": "Cover, and cook until meat is tender, on Low for 8 hours, or on High for 4 to 5 hours. Stir once or twice during cook time."
        },
        {
          "step4": "Serve hot and enjoy!"
        }
      ]
    },
    {
      "items": ["Meatball", "Barbeque Sauce", "Grape Jelly"],
      "recipeName": "Crock Pot Grape Jelly Meatballs",
      "ingredients": ["Meatballs", "BBQ Sauce", "Grape Jelly"],
      "websiteLink": "https://www.somewhatsimple.com/crock-pot-meatballs/",
      "steps": [
        {
          "step1": "Place the frozen meatballs into your crock pot."
        },
        {
          "step2": "In a small bowl, mix together the grape jelly and BBQ sauce until well blended. Pour over meatballs."
        },
        {
          "step3": "Cook on low all day or on high for 2-4 hours."
        },
        {
          "step4": "Serve as a party appetizer or partner with mashed potatoes and dinner rolls for a delicious dinner!"
        }
      ]
    },
    {
      "items": ["Beef Blade", "Chuck Roast", "Beef Broth", "Onion Soup Mix"],
      "recipeName": "Shredded Beef",
      "ingredients": [
        "3-4 pounds beef blade/chuck roast",
        "4 cups of beef broth",
        "1 tablespoon onion soup mix"
      ],
      "websiteLink": "https://www.thekitchenmagpie.com/fast-and-delicious-3-ingredient-shredded-beef/",
      "steps": [
        {
          "step1": "Place the beef broth and soup mix into a large crock pot, stir until combined."
        },
        {
          "step2": "Place the beef roast into the liquid. If preferred, you can also brown the roast in a large frying pan, then transfer to the slow cooker."
        },
        {
          "step3": "Cook on low for 8-10 hours."
        },
        {
          "step4": "Shred the beef with two forks IN the slow cooker, the gravy will help keep it moist and delicious."
        },
        {
          "step5": "Use in sandwiches or as a main meal with mashed potatoes."
        },
        {
          "step6": "Using the saute button, brown the roast in 1 tbsp of oil until browned on all sides."
        },
        {
          "step7": "Add in the broth and the soup mix."
        },
        {
          "step8": "Cook for 120 minutes on high pressure according to manufacturer's instructions. Release according to manufacturers instructions."
        },
        {
          "step9": "Shred the beef with two forks IN the pot, the gravy will help keep it moist and delicious."
        },
        {
          "step10": "Use in sandwiches or as a main meal with mashed potatoes."
        }
      ]
    },
    {
      "items": ["Beef Stew Meat", "Onion Soup", "Mushroom Soup"],
      "recipeName": "Slow Cooker Beef",
      "ingredients": [
        "3 pounds stew beef",
        "1 can cream of onion soup",
        "1 can cream of mushroom soup"
      ],
      "websiteLink": "https://lifewiththecrustcutoff.com/three-ingredient-crockpot-beef-tips/",
      "steps": [
        {
          "step1": "Mix the two soups in the bottom of your crockpot, add the beef and stir."
        },
        {
          "step2": "Cover and let cook on low for 6-8 hours or high for 4-6 hours."
        },
        {
          "step3": "Twenty minutes before eating throw in your cooked peas or cooked carrots or any other cooked veggies."
        },
        {
          "step4": "Serve over rice, noodles or potatoes."
        }
      ]
    },
    {
      "items": ["Ground Beef", "Ketchup", "Yellow Mustard"],
      "recipeName": "Sloppy Joes",
      "ingredients": ["Ground Beef", "Ketchup", "Yellow Mustard"],
      "websiteLink": "https://theshortordercook.com/3-ingredient-sloppy-joes-gluten-free/#ingredients",
      "steps": [
        {
          "step1": "In a medium pot, add the ground beef & cover with 1-2 inches of water. Break up the meat in the water using a wooden spoon or spatula."
        },
        {
          "step2": "Once the ground beef is broken up it should look like this. It is not pretty, I admit but it will be so good."
        },
        {
          "step3": "Bring the meat and water to a boil over medium-high heat. Once it is boiling, turn it down to a low simmer. Let cook until all the meat is brown, about 3 minutes."
        },
        {
          "step4": "Drain the meat in a colander with fine openings. Return the meat to the pot."
        },
        {
          "step5": "Add in 1 cup of ketchup and ¼ a cup of yellow mustard. Keep the heat on low and let it heat through for 5 minutes. Stir occasionally."
        },
        {
          "step6": "Once the meat is ready, use a small spoon to do a taste test. Add optional salt & pepper to taste if desired."
        },
        {
          "step7": "Toast up some hamburger buns or your favorite rolls. Add the sloppy joe meat to each bun."
        }
      ]
    },
    {
      "items": ["Ground Beef", "Cheddar Cheese", "Grands Biscuit"],
      "recipeName": "Cheeseburger Pockets",
      "ingredients": [
        "1 lb. ground beef",
        "1 cup shredded cheddar cheese",
        "1 tube Grands Biscuits"
      ],
      "websiteLink": "https://www.mynameissnickerdoodle.com/fabulous-food-friday-18/",
      "steps": [
        {
          "step1": "Brown beef and drain if necessary. Take off burner."
        },
        {
          "step2": "Add in cheese and mix until melted. Set side."
        },
        {
          "step3": "Preheat oven to 350º."
        },
        {
          "step4": "Roll out each biscuit until thin."
        },
        {
          "step5": "Place about 3 large TBSP of meat onto center."
        },
        {
          "step6": "Fold in half and seal edges with fork tines."
        },
        {
          "step7": "Place on a greased cookie sheet."
        },
        {
          "step8": "Bake for 12-14 minutes until golden brown."
        },
        {
          "step9": "Serve. Dip into mustard and ketchup."
        }
      ]
    },
    {
      "items": ["Beef Stock", "Onion Soup Mix", "Chuck Roast"],
      "recipeName": "Pulled Beef",
      "ingredients": [
        "3 cups beef stock",
        "1 packet French onion soup mix",
        "1.5kg chuck roast"
      ],
      "websiteLink": "https://www.4ingredients.com.au/recipes/3-ingredient-pulled-beef",
      "steps": [
        {
          "step1": "Place the stock and soup mix into a slow cooker bowl, stir until combined."
        },
        {
          "step2": "Place the beef into the liquid. Season with cracked pepper."
        },
        {
          "step3": "Cover and cook on LOW for 8 hours."
        },
        {
          "step4": "Using 2 forks, shred the beef IN the slow cooker, mixing it through the yummy gravy that results."
        },
        {
          "step5": "Use in pies, sandwiches or as a main meal with mashed potatoes and steamed greens."
        }
      ]
    },
    {
      "items": ["Egg Noodles", "Beef Broth", "Pot Roast"],
      "recipeName": "Beef and Noodles",
      "ingredients": ["Frozen egg noodles ", "Beef broth", "Cooked pot roast"],
      "websiteLink": "https://www.lifeissweeterbydesign.com/three-ingredient-beef-and-noodles/#INGREDIENTS_FOR_BEEF_AND_NOODLES",
      "steps": [
        {
          "step1": "Bring beef broth and diced pot roast to a boil in a large saucepan."
        },
        {
          "step2": "Add your frozen egg noodles and cook according to package instructions for the egg noodles."
        },
        {
          "step3": "Once the egg noodles are cooked you are set!"
        },
        {
          "step4": "You can add salt and pepper to taste if you prefer."
        }
      ]
    },
    {
      "items": [
        "Ground Pork Sausage",
        "Ground Spicy Pork Sausage",
        "Frozen Orange Juice"
      ],
      "recipeName": "Easy Appetizer Meatballs",
      "ingredients": [
        "1 pound ground pork sausage",
        "1 pound ground spicy pork sausage",
        "1 (6 ounces) can of frozen orange juice concentrate (thawed)"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/244436/easy-appetizer-meatballs/",
      "steps": [
        {
          "step1": "Combine pork sausage and spicy pork sausage together in a bowl using your hands. Form mixture into meatballs, about 1 tablespoon each."
        },
        {
          "step2": "Fry meatballs in a skillet over medium heat until browned and completely cooked through, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C)."
        },
        {
          "step3": "Transfer meatballs to a large bowl and add 1/2 of the orange juice concentrate; gently toss to coat, adding more if needed to completely coat."
        },
        {
          "step4": "Put meatballs in a slow cooker and add the remaining orange juice concentrate; turn on Low setting to keep warm before serving."
        }
      ]
    },
    {
      "items": ["Pork Chop", "Salt", "Black Pepper", "Thyme"],
      "recipeName": "Perfect Simple Roasted Pork Chops",
      "ingredients": [
        "4 boneless center-cut pork chops",
        "salt and ground black pepper to taste",
        "2 tablespoons dried thyme (lightly crushed, or more to taste)"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/266162/perfect-simple-roasted-pork-chops/",
      "steps": [
        {
          "step1": "Preheat the oven to 375 degrees F (190 degrees C)."
        },
        {
          "step2": "Sprinkle chops on all sides with thyme, salt, and pepper. Place on a baking sheet."
        },
        {
          "step3": "Bake in the preheated oven until a meat thermometer inserted into the thickest part of a pork chop reads 165 degrees F (74 degrees C), about 20 minutes."
        },
        {
          "step4": "Tent aluminum foil over the chops and let rest 5 to 10 minutes before serving."
        }
      ]
    },
    {
      "items": ["Baked Ham", "Brown Sugar", "Cola"],
      "recipeName": "Cola-Glazed Ham",
      "ingredients": [
        "1 (8 pound) baked ham",
        "1 cup brown sugar",
        "2 (12 fluid ounce) cans or bottles cola-flavored carbonated beverage"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/245486/cola-glazed-ham/",
      "steps": [
        {
          "step1": "Preheat the oven to 300 degrees F (150 degrees C)."
        },
        {
          "step2": "Line a 9x13-inch baking pan with aluminum foil, and place ham into the pan."
        },
        {
          "step3": "Place brown sugar in a bowl; whisk in just enough cola to dissolve sugar and form a thick glaze."
        },
        {
          "step4": "Pour glaze over ham, then add remaining cola to the bottom of the baking pan."
        },
        {
          "step5": "Bake in the preheated oven, occasionally basting with glaze, for 2 hours."
        },
        {
          "step6": "Transfer ham to a serving platter and tent with foil for up to 30 minutes before serving."
        }
      ]
    },
    {
      "items": ["Pork Chop", "Cooking Spray", "Ranch Salad Dressing Mix"],
      "recipeName": "Air Fryer Ranch Pork Chops",
      "ingredients": [
        "4 boneless center-cut pork chops (1-inch thick)",
        "cooking spray",
        "2 teaspoons dry ranch salad dressing mix (such as Hidden Valley Ranch)"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/276831/air-fryer-ranch-pork-chops/",
      "steps": [
        {
          "step1": "Place pork chops onto a plate and lightly spray both sides with cooking spray."
        },
        {
          "step2": "Sprinkle both sides with ranch seasoning mix and let sit at room temperature for 10 minutes."
        },
        {
          "step3": "Spray an air fryer basket with cooking spray and preheat the air fryer to 390 degrees F (200 degrees C)."
        },
        {
          "step4": "Working in batches if necessary to ensure they are not overcrowded, place chops into the preheated air fryer. Cook for 10 minutes, flipping halfway through. "
        },
        {
          "step5": "Transfer to a foil-covered plate and let sit for 5 minutes before serving."
        }
      ]
    },
    {
      "items": ["Ham Steak", "Butter", "Brown Sugar"],
      "recipeName": "Brown Sugar Ham Steak",
      "ingredients": [
        "1 (8 ounce) bone-in fully cooked ham steak",
        "5 tablespoons butter (cubed)",
        "5 tablespoons brown sugar"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/236432/brown-sugar-ham-steak/",
      "steps": [
        {
          "step1": "Cook ham steak in a large skillet over medium heat until browned, 3 to 4 minutes per side."
        },
        {
          "step2": "Remove ham from skillet; drain off any fat."
        },
        {
          "step3": "Melt butter in the same skillet over medium-low heat. Stir in brown sugar."
        },
        {
          "step4": "Return ham to skillet."
        },
        {
          "step5": "Cook, turning ham often, until heated through and brown sugar has dissolved, about 10 minutes."
        },
        {
          "step6": "Reduce heat if brown sugar/butter mixture starts to pop or splatter."
        }
      ]
    },
    {
      "items": ["Pork Tenderloin", "Dr. Pepper", "Barbeque Sauce"],
      "recipeName": "Slow Cooker Dr. Pepper Pulled Pork",
      "ingredients": [
        "1 - 3 to 4 pound boneless pork tenderloin",
        "1 ½ cups Dr Pepper",
        "2 cups barbecue sauce"
      ],
      "websiteLink": "https://www.gracefullittlehoneybee.com/slow-cooker-dr-pepper-pulled-pork-only-three-ingredients/",
      "steps": [
        {
          "step1": "Place the tenderloin in the bottom of the slow cooker liner and pour the Dr. Pepper over the top."
        },
        {
          "step2": "Cover and cook on low for 8 to 10 hours or until the tenderloin is fork tender."
        },
        {
          "step3": "Discard the remaining liquid. Shred the pork and stir in the barbecue sauce."
        },
        {
          "step4": "Allow the shredded pork to simmer in the slow cooker for an additional 30 minutes prior to serving."
        },
        {
          "step5": "Serve on buns, over baked potatoes, or alone."
        }
      ]
    },
    {
      "items": ["Pork Chop", "Brown Sugar", "Italian Dressing Mix"],
      "recipeName": "Brown Sugar Italian Pork Chops",
      "ingredients": [
        "8 boneless pork chops",
        "½ cup brown sugar",
        "1 (0.7-oz) packet Italian Dressing Mix"
      ],
      "websiteLink": "https://www.plainchicken.com/3-ingredient-brown-sugar-italian-pork/",
      "steps": [
        {
          "step1": "Preheat oven to 425ºF. Line a 9×13-inch baking pan with aluminum foil."
        },
        {
          "step2": "Combine the brown sugar and Italian dressing mix. Coat both sides of the pork chops with the brown sugar mixture."
        },
        {
          "step3": "Place in prepared pan. Top pork chops with any remaining brown sugar mixture."
        },
        {
          "step4": "Turn broiler on HIGH. Broil pork chops until brown sugar caramelizes, about 1 to 2 minutes. Watch it carefully so it doesn’t burn!"
        }
      ]
    },
    {
      "items": [
        "Pork Chop",
        "Ranch Seasoning",
        "Cream of Condensed Chicken Soup"
      ],
      "recipeName": "Crock Pot Pork Chops",
      "ingredients": [
        "Thick bone-in pork chops",
        "A packet of ranch seasoning",
        "Can of cream of condensed chicken soup"
      ],
      "websiteLink": "https://www.backtomysouthernroots.com/easy-3-ingredient-crock-pot-pork-chops/",
      "steps": [
        {
          "step1": "Grease the Crock Pot with nonstick cooking spray. Place pork chops into the bottom of the Crock Pot."
        },
        {
          "step2": "Next, sprinkle the ranch seasoning on top of the pork chops."
        },
        {
          "step3": "Spread the condensed cream of chicken soup all over the pork chops."
        },
        {
          "step4": "Place the lid on top and cook for five to five and a half hours on low."
        },
        {
          "step5": "Once it’s finished cooking, you can shred the meat, and you will have some delicious gravy to spread on top."
        }
      ]
    },
    {
      "items": [
        "Pork Chop",
        "French Onion Packet",
        "Cream of Condensed Mushroom Soup"
      ],
      "recipeName": "French Crock Pot Pork Chops",
      "ingredients": [
        "Pork Chops",
        "French Onion Packet",
        "Cream of Mushroom Soup"
      ],
      "websiteLink": "https://www.crockpotsandflipflops.com/crock-pot-french-onion-pork-chops/",
      "steps": [
        {
          "step1": "Add pork chops to the bottom of the slow cooker."
        },
        {
          "step2": "Sprinkle french onion packet over pork chops."
        },
        {
          "step3": "Pour cream of mushroom soup over pork chops."
        },
        {
          "step4": "Cook on low for 4-6 hours or high for 2-3 hours. Cook until internal temperature reaches 145 ºF."
        },
        {
          "step5": "Serve with gravy poured on top of pork chops."
        }
      ]
    },
    {
      "items": ["Shrimp", "Butter", "Garlic"],
      "recipeName": "Garlic Butter Shrimp",
      "ingredients": [
        "2 pounds shrimp",
        "¼-1/2 cup butter",
        "2 freshly minced garlic"
      ],
      "websiteLink": "https://www.heavenlyhomemakers.com/simple-garlic-butter-shrimp-recipe-3-ingredients",
      "steps": [
        {
          "step1": "Cook ingredients together in a skillet for 20-30 minutes, stirring occasionally."
        },
        {
          "step2": "Serve."
        }
      ]
    },
    {
      "items": ["Canned Tuna", "Pasta", "Mayonnaise"],
      "recipeName": "Tuna Salad",
      "ingredients": [
        "Canned tuna",
        "Pasta (e.g., elbow macaroni or penne)",
        "Mayonnaise"
      ],
      "websiteLink": "https://highchairchronicles.com/3-ingredient-tuna-salad/",
      "steps": [
        {
          "step1": "Thoroughly drain the canned tuna through a colander."
        },
        {
          "step2": "In a large bowl, combine all the ingredients and mix well."
        },
        {
          "step3": "Serve chilled on crackers or in a sandwich."
        }
      ]
    },
    {
      "items": ["Canned Tomato Sauce Sardines", "Bread", "Garlic"],
      "recipeName": "Spicy Sardine Sandwhich",
      "ingredients": [
        "Canned sardines in tomato sauce",
        "Bread slices",
        "garlic cloves"
      ],
      "websiteLink": "https://www.bbcgoodfood.com/recipes/open-sandwiches-tomato-sardine-rocket",
      "steps": [
        {
          "step1": "Toast a thick slice of baguette. Cut the garlic clove in half and rub the cut side over the surface."
        },
        {
          "step2": "Halve the tomato and squeeze and rub the flesh over the bread."
        },
        {
          "step3": "Top with the sardines and rocket."
        }
      ]
    },
    {
      "items": ["Milkfish", "White Vinegar", "Garlic"],
      "recipeName": "Fried Bangus Or Milkfish",
      "ingredients": [
        "1 Bangus or milkfish",
        "1/2 cup white vinegar",
        "4 cloves garlic crushed"
      ],
      "websiteLink": "https://panlasangpinoy.com/fried-bangus-recipe/",
      "steps": [
        {
          "step1": "Wash and clean the milkfish."
        },
        {
          "step2": "Slice the fish into 4 pieces and add seasoning."
        },
        {
          "step3": "Prepare the marinade."
        },
        {
          "step4": "Rub the marinade into the flesh."
        },
        {
          "step5": "Fry the fish pieces until golden brown."
        },
        {
          "step6": "Drain the excess oil from the milkfish pieces."
        },
        {
          "step7": "Serve with white rice and spiced vinegar accompaniment."
        }
      ]
    },
    {
      "items": ["Tilapia Fillet", "Butter", "Olive Oil"],
      "recipeName": "Pan Seared Tilapia",
      "ingredients": [
        "4 tilapia fillets (about 6 ounces each)",
        "1 tablespoon butter",
        "1 tablespoon olive oil"
      ],
      "websiteLink": "https://30seconds.com/food/tip/55017/10-Minute-Buttery-Tilapia-Recipe-The-Easiest-3-Ingredient-Fish-Recipe-Ever",
      "steps": [
        {
          "step1": "Melt the butter and olive oil together in a large skillet over medium-high heat. "
        },
        {
          "step2": "Season the tilapia with salt and pepper."
        },
        {
          "step3": "Add the tilapia to the pan and cook about 3 minutes per side or until just cooked through. "
        }
      ]
    },
    {
      "items": ["Tilapia Fillet", "Butter", "String Beans"],
      "recipeName": "Tilapia with String Beans",
      "ingredients": [
        "1 tilapia",
        "1 tablespoon butter",
        "5 string beans (cut to preference)"
      ],
      "websiteLink": "https://www.foodnetwork.com/recipes/photos/tilapia-recipes",
      "steps": [
        {
          "step1": "Start by washing and preparing the string beans. Trim the ends and cut them to your desired size. You can leave them whole or chop them into smaller pieces."
        },
        {
          "step2": "Heat a skillet or frying pan over medium-high heat and add the butter. Allow the butter to melt and coat the pan evenly."
        },
        {
          "step3": "Place the tilapia fillet in the skillet, and arrange the cut string beans around it."
        },
        {
          "step4": "Cook the tilapia and string beans for a few minutes on one side until the tilapia begins to turn golden brown and the string beans start to become tender."
        },
        {
          "step5": "Carefully flip the tilapia to cook the other side. Continue cooking until the fish is cooked through and flakes easily with a fork. This typically takes about 2-4 minutes per side, depending on the thickness of the fillet."
        },
        {
          "step6": "As the tilapia and string beans cook, you can season them with salt, pepper, or your preferred seasonings to taste."
        },
        {
          "step7": "Once the tilapia is done and the string beans are tender, remove them from the pan."
        },
        {
          "step8": "Serve the cooked tilapia with the sautéed string beans on a plate."
        }
      ]
    },
    {
      "items": ["Flour", "Butter", "Calamari", "Cooking Oil"],
      "recipeName": "Fried Calamari",
      "ingredients": [
        "1 cup flour",
        "butter",
        "1 pound calamari (cleaned and cut into rings)",
        "oil for frying"
      ],
      "websiteLink": "https://www.closetcooking.com/fried-calamari/",
      "steps": [
        {
          "step1": "Mix the flour, salt and pepper in a bowl."
        },
        {
          "step2": "Dredge the calamari in the flour."
        },
        {
          "step3": "Fry the calamari in the preheated 357F oil until golden brown, about 2 minutes."
        }
      ]
    },
    {
      "items": ["Bread", "Canned Tuna", "Cheese"],
      "recipeName": "Tuna Melts",
      "ingredients": [
        "4 pieces of bread (any kind)",
        "(6 ounce) can canned tuna",
        "8 slices of cheese"
      ],
      "websiteLink": "https://www.food.com/recipe/tuna-melts-134058",
      "steps": [
        {
          "step1": "Separate buns and lay on cookie sheet so that the inside of the bun is facing up."
        },
        {
          "step2": "Divide tuna evenly onto each bun."
        },
        {
          "step3": "Top each bun with two slices of cheese."
        },
        {
          "step4": "Broil for 3-5 minutes, or until cheese is melted and the sides of the buns begin to brown."
        }
      ]
    },
    {
      "items": ["Mussel", "Butter", "Lemon"],
      "recipeName": "Richard Corrigan's Mussels",
      "ingredients": ["mussels / tahong", "butter", "lemon"],
      "websiteLink": "https://www.rte.ie/lifestyle/recipes/2011/1004/746445-mussels/",
      "steps": [
        {
          "step1": "Put mussels in a pan with a little butter."
        },
        {
          "step2": "Cover and cook for 3 minutes or until the mussels open."
        },
        {
          "step3": "Sprinkle with lemon juice."
        }
      ]
    },
    {
      "items": ["Shrimp", "Bacon", "Butter"],
      "recipeName": "Air Fryer Bacon Wrapped Shrimp",
      "ingredients": [
        "12 oz Medium Cooked Shrimp",
        "16 oz Center-Cut Bacon",
        "butter"
      ],
      "websiteLink": "https://airfryerfanatics.com/air-fryer-bacon-wrapped-shrimp-ninja-foodi/",
      "steps": [
        {
          "step1": "Peel, deveine, and cook shrimp with the tail-on."
        },
        {
          "step2": "The air fryer basket will need to be sprayed with olive oil cooking spray."
        },
        {
          "step3": "Wrap the bacon around the shrimp so that the seam is on the bottom and place the shrimp seam side down in the air fryer basket."
        },
        {
          "step4": "Once they are cooked, they will come out with the bacon wrapped around the shrimp without coming off, it’ll be crisp to the shrimp."
        }
      ]
    },
    {
      "items": [
        "Chicken Breast",
        "Cream of Condensed Chicken Soup",
        "Frozen Mixed Veggies"
      ],
      "recipeName": "Slow Cooker Chicken & Dumplings",
      "ingredients": [
        "4 skinless, boneless chicken breasts",
        "2 cans of condensed cream of chicken soup",
        "Bag of frozen mixed veggies (carrots and peas)"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "After cooking 4-5 hours on High, shred chicken and add:"
        },
        {
          "step2": "Bag of frozen mixed veggies (carrots and peas)"
        },
        {
          "step3": "1-2 Cans of refrigerated biscuits, torn into pieces"
        },
        {
          "step4": "Cook for 30-60 minutes, until dough is cooked through."
        }
      ]
    },
    {
      "items": ["Chicken Breast", "Chicken Stock", "Salsa Verde"],
      "recipeName": "Crock Pot White Chicken Chili",
      "ingredients": [
        "2 boneless, skinless chicken breasts",
        "6 cups chicken stock",
        "2 cups salsa verde",
        "2 cans Great Northern beans"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "In your Crock Pot, combine: 2 boneless, skinless chicken breasts, 6 cups chicken stock, 2 cups salsa verde. Cook for on Low for 6-8 hours (or High for 3-4)"
        },
        {
          "step2": "In the last 30 minutes of cooking, add: 2 cans Great Northern beans"
        }
      ]
    },
    {
      "items": ["Chicken Breast", "Alfredo Sauce", "Broccoli"],
      "recipeName": "Crock Pot Chicken Broccoli Alfredo",
      "ingredients": [
        "4 boneless, skinless chicken breasts",
        "2 jars of alfredo sauce",
        "Bag of frozen broccoli florets",
        "Sprinkle of shredded parmesan cheese"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "In the slow cooker, add 4 boneless, skinless chicken breasts, 2 jars of alfredo sauce. Cook on High for 2.5 hours (or Low for 5 hours)."
        },
        {
          "step2": "Then add Bag of frozen broccoli florets, Sprinkle of shredded parmesan cheese."
        }
      ]
    },
    {
      "items": ["Chicken Breast", "Salsa", "Corn", "Black Beans"],
      "recipeName": "Slow Cooker Salsa Chicken",
      "ingredients": [
        "4 boneless, skinless chicken breasts",
        "Jar of salsa",
        "Small bag of frozen corn",
        "Can of black beans"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "In your Crock Pot, combine: 4 boneless, skinless chicken breasts, Jar of salsa, Small bag of frozen corn, Can of black beans. Cook on Low for 4-6 hours."
        }
      ]
    },
    {
      "items": [
        "Chicken Breast",
        "Apricot Preserve",
        "Asian Sesame Salad Dressing",
        "Dry Onion Soup Mix"
      ],
      "recipeName": "Easy Italian Slow Cooker Creamy Chicken",
      "ingredients": [
        "4 boneless, skinless chicken breasts",
        "⅓ cup of apricot preserves",
        "1 cup of Asian sesame salad dressing",
        "1 packet dry onion soup mix"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "In your Crock Pot, combine: 2 boneless, skinless chicken breasts, 8 oz block cream cheese, can of condensed cream of chicken soup, packet of dry Italian dressing mix."
        },
        {
          "step2": "Cook on High for 3 hours (or Low for 6 hours). Shred chicken, if desired, and serve over pasta or rice."
        },
        {
          "step3": " Shred chicken, if desired, and serve over pasta or rice."
        }
      ]
    },
    {
      "items": [
        "Chicken Breast",
        "Salsa",
        "Ranch Salad Dressing Mix",
        "Taco Seasoning Mix"
      ],
      "recipeName": "Asian Sesame Crockpot Chicken",
      "ingredients": [
        "2 boneless, skinless chicken breasts",
        "1 cup of salsa",
        "Packet of ranch dressing seasoning mix",
        "1 tbs. taco seasoning packet"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "In your slow cooker, combine: 4 boneless, skinless chicken breasts, ⅓ cup of apricot preserves, 1 cup of Asian sesame salad dressing, 1 packet dry onion soup mix."
        },
        {
          "step2": "Combine preserves, salad dressing, and soup mix, then pour over chicken breasts."
        },
        {
          "step3": "Cook on Low for 5-7 hours."
        }
      ]
    },
    {
      "items": [
        "Chicken Breast",
        "Salsa",
        "Ranch Salad Dressing Mix",
        "Taco Seasoning Mix"
      ],
      "recipeName": "Chicken Ranch Tacos in the Slow Cooker",
      "ingredients": [
        "2 boneless, skinless chicken breasts",
        "1 cup of salsa",
        "Packet of ranch dressing seasoning mix",
        "1 tbs. taco seasoning packet"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Place the two boneless, skinless chicken breasts in the slow cooker."
        },
        {
          "step2": "In a bowl, mix together the cup of salsa, the packet of ranch dressing seasoning mix, and the taco seasoning."
        },
        {
          "step3": "Pour the salsa mixture over the chicken breasts in the slow cooker."
        },
        {
          "step4": "Cover the slow cooker with its lid."
        },
        {
          "step5": "Cook the chicken on low heat for 6-8 hours or on high heat for 3-4 hours. The chicken will become tender and absorb the flavors of the salsa and seasonings."
        },
        {
          "step6": "About 30 minutes before serving, use two forks to shred the chicken directly in the slow cooker. This will allow the shredded chicken to soak in the flavorful sauce."
        },
        {
          "step7": "Continue cooking for the remaining time to enhance the flavor of the shredded chicken."
        },
        {
          "step8": "Serve the Chicken Ranch Tacos in your choice of taco shells, tortillas, or on a bed of lettuce as a salad. Add your favorite taco toppings like cheese, sour cream, diced tomatoes, and shredded lettuce."
        }
      ]
    },
    {
      "items": [
        "Chicken Breast",
        "Italian Dressing",
        "Italian Dressing Mix",
        "Potato"
      ],
      "recipeName": "Crock Pot Italian Chicken and Potatoes",
      "ingredients": [
        "3-4 boneless, skinless chicken breasts",
        "4 potatoes, cubed",
        "½ cup Italian dressing",
        "1 tsp dried Italian dressing seasoning packet"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Place the cubed potatoes in the bottom of your slow cooker."
        },
        {
          "step2": "Lay the boneless, skinless chicken breasts on top of the potatoes."
        },
        {
          "step3": "In a bowl, combine the 1/2 cup of Italian dressing with the 1 teaspoon of dried Italian dressing seasoning packet. Mix well to ensure the seasoning is fully incorporated into the dressing."
        },
        {
          "step4": "Pour the Italian dressing mixture over the chicken and potatoes in the slow cooker."
        },
        {
          "step5": "Cover the slow cooker with its lid."
        },
        {
          "step6": "Cook on low heat for 6-7 hours or on high heat for 3-4 hours. The chicken will become tender, and the potatoes will be soft and infused with the Italian flavors."
        },
        {
          "step7": "About 30 minutes before serving, check the chicken's internal temperature with a meat thermometer. It should reach 165°F (74°C) to ensure it's fully cooked."
        },
        {
          "step8": "Once the chicken and potatoes are cooked through, you can serve them hot. The potatoes will be flavorful and the chicken will be tender and juicy, thanks to the Italian dressing and seasoning."
        }
      ]
    },
    {
      "items": [
        "Chicken Breast",
        "Barbeque Sauce",
        "Italian Dressing",
        "Brown Sugar"
      ],
      "recipeName": "Slow Cooker BBQ Pulled Chicken",
      "ingredients": [
        "4 boneless, skinless chicken breasts",
        "Bottle of BBQ sauce",
        "½ cup Italian dressing",
        "¼ cup brown sugar"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "In your Crockpot, combine: 4 boneless, skinless chicken breasts, Bottle of BBQ sauce, ½ cup Italian dressing, ¼ cup brown sugar."
        },
        {
          "step2": "Cook on High for 4 hours (or low for 8 hours)."
        },
        {
          "step3": "Shred the chicken and serve with tortillas."
        }
      ]
    },
    {
      "items": ["Chicken Breast", "Pesto Sauce", "Garlic", "Chicken Broth"],
      "recipeName": "Slow Cooker Garlic Pesto Chicken",
      "ingredients": [
        "4 boneless, skinless chicken breasts",
        "1 jar pesto sauce",
        "2 cloves garlic",
        "1 cup chicken broth"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "In your Crockpot, combine: 4 boneless, skinless chicken breasts, 1 jar pesto sauce, 2 cloves garlic, 1 cup chicken broth."
        },
        {
          "step2": "Cook on Low for 4-6 hours."
        }
      ]
    },
    {
      "items": [
        "Vegetable Stock",
        "Butternut Pumpkin",
        "Rice",
        "Parmesan Cheese"
      ],
      "recipeName": "Pumpkin Risotto",
      "ingredients": [
        "3 cups vegetable stock",
        "700 grams butternut pumpkin",
        "3/4 cup rice",
        "1/2 cup parmesan cheese"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "In a saucepan, bring the vegetable stock and pumpkin pieces to the boil."
        },
        {
          "step2": "Reduce heat, cover, and simmer for 10 minutes."
        },
        {
          "step3": "Add the rice and continue to simmer for 20 minutes, stirring regularly, or until the rice is soft and most of the liquid has been absorbed."
        },
        {
          "step4": "Stir through half the Parmesan and season with sea salt and pepper."
        },
        {
          "step5": "Serve sprinkled with remaining Parmesan."
        }
      ]
    },
    {
      "items": ["Mushroom", "Bell Pepper", "Tofu", "Salsa"],
      "recipeName": "Four Ingredient Scrambled Tofu",
      "ingredients": [
        "Handful chopped mushrooms",
        "1/2 bell pepper",
        "1/2 block medium-firm tofu",
        "Salsa"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Dice the mushrooms and bell peppers into small pieces and fry over medium heat in a non-stick pan with a bit of oil (optional). Sprinkle with salt. Cook until mushrooms are browned (I like to let the mushrooms sit for a bit to brown)."
        },
        {
          "step2": "Add the medium-firm tofu (crumble it with fingers) and mix with the vegetables. Let it sit for a couple minutes until the tofu browns then mix well with the vegetables."
        },
        {
          "step3": "Add as much salsa as you want for flavor, add salt to taste, and you are ready to eat!"
        }
      ]
    },
    {
      "items": ["Eggplant", "Olive Oil", "Lime Juice", "Seasoning"],
      "recipeName": "Spicy Grilled Eggplant",
      "ingredients": [
        "2 small eggplants",
        "1/4 cup olive oil",
        "2 tablespoons lime juice",
        "3 teaspoons seasoning"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Brush eggplant slices with oil. Drizzle with lime juice; sprinkle with Cajun seasoning. Let stand 5 minutes."
        },
        {
          "step2": "Grill eggplant, covered, over medium heat or broil 4 in. from heat until tender, 4-5 minutes per side."
        }
      ]
    },
    {
      "items": [
        "Rice Pilaf Mix with Toasted Almonds",
        "Butter",
        "Peas",
        "Mushroom"
      ],
      "recipeName": "Mushrooms & Peas Rice Pilaf",
      "ingredients": [
        "1 package rice pilaf mix with toasted almonds",
        "1 tablespoon butter",
        "1-1/2 cups fresh or frozen peas",
        "1 cup sliced baby portobello mushrooms"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Prepare pilaf according to package directions."
        },
        {
          "step2": "In a large skillet, heat butter over medium heat. Add peas and mushrooms; cook and stir until tender, 6-8 minutes. Stir in rice."
        }
      ]
    },
    {
      "items": ["Carrot", "Thyme", "Canola Oil", "Honey"],
      "recipeName": "Roasted Carrots with Thyme",
      "ingredients": [
        "1 pound medium carrots",
        "2 teaspoons minced fresh thyme or 1/2 teaspoon dried thyme",
        "2 teaspoons canola oil",
        "1 teaspoon honey"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Preheat oven to 400°. Place carrots in a greased 15x10x1-in. baking pan."
        },
        {
          "step2": "In a small bowl, mix thyme, oil, honey, and salt; brush over carrots. Roast until tender, 20-25 minutes."
        }
      ]
    },
    {
      "items": ["Butternut Pumpkin", "Salt", "Butter", "Brown Sugar"],
      "recipeName": "Whipped Squash",
      "ingredients": [
        "1 butternut squash",
        "3/4 teaspoon salt",
        "2 tablespoons butter",
        "1 tablespoon brown sugar"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "In a saucepan over medium heat, bring squash, 3 cups water, and, if desired, 1/2 teaspoon salt to a boil. Reduce heat; cover and simmer for 20 minutes or until the squash is tender."
        },
        {
          "step2": "Drain; transfer to a bowl. Add butter, brown sugar, nutmeg, and, if desired, remaining salt; beat until smooth."
        }
      ]
    },
    {
      "items": ["Bread", "Butter", "Egg", "Salt", "Black Pepper"],
      "recipeName": "Toad in the Hole",
      "ingredients": [
        "1 slice of bread",
        "1 teaspoon butter",
        "1 large egg",
        "Salt and pepper to taste"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Cut a 3-in. hole in the middle of the bread and discard."
        },
        {
          "step2": "In a small skillet, melt the butter; place the bread in the skillet."
        },
        {
          "step3": "Place egg in the hole. Cook over medium heat until the bread is lightly browned, about 2 minutes."
        },
        {
          "step4": "Turn and cook the other side until egg yolk is almost set. Season with salt and pepper."
        }
      ]
    },
    {
      "items": ["Green Beans", "Butter", "Parsley", "Lemon Juice"],
      "recipeName": "Snappy Green Beans",
      "ingredients": [
        "2 pounds fresh green beans",
        "2 teaspoons butter",
        "2 tablespoons minced fresh parsley",
        "2 teaspoons lemon juice"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Place beans in a large saucepan and cover with water; bring to a boil. Cook, uncovered, for 8-10 minutes or until crisp-tender. Drain well."
        },
        {
          "step2": "Remove from the heat. Add the butter, parsley, lemon juice, salt, and pepper; toss to coat."
        }
      ]
    },
    {
      "items": ["Watermelon", "Mint", "Lemon Juice", "Olive Oil"],
      "recipeName": "Mint Watermelon Salad",
      "ingredients": [
        "6 cups cubed seedless watermelon",
        "2 tablespoons minced fresh mint",
        "1 tablespoon lemon juice",
        "1 tablespoon olive oil"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Place watermelon and mint in a large bowl."
        },
        {
          "step2": "In a small bowl, whisk lemon juice, oil, and sugar until sugar is dissolved. Drizzle over the salad; toss gently to combine."
        }
      ]
    },
    {
      "items": ["Mushroom", "Minced Garlic", "Seasoned Bread Crumbs", "Butter"],
      "recipeName": "Sauteed Garlic Mushrooms",
      "ingredients": [
        "3/4 pound sliced fresh mushrooms",
        "2 to 3 teaspoons minced garlic",
        "1 tablespoon seasoned bread crumbs",
        "1/3 cup butter"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "In a large cast-iron or other heavy skillet, sauté the mushrooms, garlic, and bread crumbs in butter until mushrooms are tender, 3-5 minutes."
        }
      ]
    },
    {
      "items": [
        "Ground Beef",
        "Cream of Condensed Mushroom Soup",
        "Tater Tots",
        "Cheddar Cheese"
      ],
      "recipeName": "Tater Tot Casserole",
      "ingredients": [
        "1 lb ground beef",
        "1 (10.5 oz.) can of cream of mushroom soup",
        "1 (28 or 32 oz.) bag frozen tater tots",
        "2 cups shredded cheddar cheese, divided"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Preheat your oven to 350°F."
        },
        {
          "step2": "Cook and stir ground beef in a large skillet over medium heat until cooked through and no longer pink. Season with salt and pepper to taste, if desired."
        },
        {
          "step3": "Once the beef has been browned, drain any grease. Then, add cream of mushroom soup and stir well. Pour into a lightly greased 9x13 baking dish and spread into an even layer."
        },
        {
          "step4": "Sprinkle 1 ½ cups of cheese evenly over the beef."
        },
        {
          "step5": "Top with an even layer of tater tots."
        },
        {
          "step6": "Bake uncovered until tater tots are golden brown, about 35-45 minutes."
        },
        {
          "step7": "Remove from the oven and sprinkle with remaining shredded cheese. Return to the oven for 3-4 minutes, just to melt the cheese a little bit."
        }
      ]
    },
    {
      "items": ["Shell Pasta", "Ground Beef", "Tomato Soup", "Cheddar Cheese"],
      "recipeName": "Hamburger Casserole",
      "ingredients": [
        "1 lb medium shell pasta",
        "1 lb ground beef",
        "2 (10 oz each) cans tomato soup",
        "1 1/2 cups cheddar cheese, grated"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Preheat oven to 375°F and grease a 9x13-inch baking dish."
        },
        {
          "step2": "In a large pot of salted water, cook pasta according to package directions. Drain and set aside."
        },
        {
          "step3": "While pasta is cooking, brown and break up hamburger in a skillet until no longer pink, seasoning how you'd like. (You can use just salt and pepper, seasoned salt, garlic powder, etc!)"
        },
        {
          "step4": "Add ground beef, tomato soup, pasta, 1/2 cup water, and half of the cheeses to the baking dish and stir to combine."
        },
        {
          "step5": "Top with remaining cheese and cover with foil. Bake 20 minutes."
        },
        {
          "step6": "Remove foil and bake 10 minutes more. If desired, broil for 2-3 minutes to brown cheese further."
        }
      ]
    },
    {
      "items": [
        "Ground Beef",
        "Spaghetti Sauce",
        "Sausage Ravioli",
        "Cheese Ravioli",
        "Mozzarella Cheese"
      ],
      "recipeName": "Ravioli Lasagna",
      "ingredients": [
        "1 pound ground beef",
        "1 jar (28 ounces) spaghetti sauce",
        "1 package (25 ounces) frozen sausage or cheese ravioli",
        "1-1/2 cups shredded part-skim mozzarella cheese"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "In a large skillet, cook and crumble the beef over medium heat until no longer pink, 5-7 minutes; drain."
        },
        {
          "step2": "In a greased 2-1/2-qt. baking dish, layer a third of the spaghetti sauce, half of the ravioli and beef, and 1/2 cup cheese; repeat layers."
        },
        {
          "step3": "Top with remaining sauce and cheese."
        },
        {
          "step4": "Cover and bake at 400°F for 40-45 minutes or until heated through. If desired, sprinkle with basil."
        }
      ]
    },
    {
      "items": [
        "Beef Stir-fry Strips",
        "Sesame Oil",
        "Barbeque Sauce",
        "Red Capsicum"
      ],
      "recipeName": "Beef Stir Fry",
      "ingredients": [
        "500 grams beef stir-fry strips",
        "3 tablespoons sesame oil",
        "1 cup BBQ Sauce",
        "1 large red capsicum sliced"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "In a bowl, marinate the beef in the BBQ sauce for at least 2 hours."
        },
        {
          "step2": "When ready to cook, heat the oil in a wok or non-stick frying pan."
        },
        {
          "step3": "Cook the beef in batches so as not to stew the meat."
        },
        {
          "step4": "When done, add all the meat back to the wok with the capsicum and toss, cooking for 1 to 2 minutes."
        }
      ]
    },
    {
      "items": [
        "Ground Beef",
        "Ground Turkey",
        "Vegetable Juice",
        "Frozen Vegetable Mix",
        "Italian Seasoning"
      ],
      "recipeName": "Vegetable Beef Soup",
      "ingredients": [
        "1/2 pound protein: 85% lean ground (beef or turkey) meat OR 1 15 ounce can no salt added kidney beans, drained and rinsed",
        "1 64 ounce bottle low-sodium vegetable juice",
        "1 32 ounce package frozen vegetable mix",
        "1 tablespoon Italian seasoning OR Celebrate Your Plate Italian Seasoning"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Before you begin, wash your hands, surfaces, and utensils."
        },
        {
          "step2": "If using ground beef or turkey, cook in a medium frying pan until no pink remains, about 6 minutes. Drain fat into a paper-towel lined bowl and throw away."
        },
        {
          "step3": "Combine your protein of choice (either cooked ground beef, turkey, or beans), vegetable juice, frozen vegetables, and Italian seasoning in a slow cooker and cook on low for 4 hours. If using a stovetop, combine ingredients in a large pot and simmer over medium heat for 10 minutes."
        }
      ]
    },
    {
      "items": ["Ground Beef", "Zucchini", "Salt", "Black Pepper"],
      "recipeName": "Beef & Vegetable Meatballs",
      "ingredients": [
        "1 pound Ground Beef (93% lean or leaner)",
        "1 cup grated zucchini",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Unroll the crescent dough and press it into a 13 x 9-inch or 11 x 7-inch baking dish. Set aside."
        },
        {
          "step2": "Brown the ground beef; drain off excess grease."
        },
        {
          "step3": "Stir about 1 cup of salsa into the meat."
        },
        {
          "step4": "Spoon the beef mixture over the crescent roll crust."
        },
        {
          "step5": "Sprinkle cheese on top."
        },
        {
          "step6": "Bake in a 350°F oven for about 20 minutes, until the crust is golden brown."
        }
      ]
    },
    {
      "items": ["Organic Beef", "Garlic", "Black Pepper", "Lemon Juice"],
      "recipeName": "Beef Jerky",
      "ingredients": [
        "2 lb. organic beef (or any meat type)",
        "1/4 tsp. Garlic",
        "1/2 tsp. ground pepper",
        "1 tsp. Lemon juice"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Cut meat into consistent strips about 1/4 inch thick. (Click here to read about the importance of meat thickness consistency.)"
        },
        {
          "step2": "Mix all of the other ingredients thoroughly, put the mix with the meat inside of a sealed bag or plastic container with a lid. Let this marinade in the refrigerator for 4-24 hours...longer is better."
        },
        {
          "step3": "Pull the meat out and lay it out on racks (click here to read about different racking methods for making beef jerky) without pieces touching."
        },
        {
          "step4": "Dehydrate/bake/smoke in your equipment of choice at 160-180°F (depending on your equipment's capabilities) or until your desired texture is reached. (Click here for more information about the different methods to make jerky at home.)"
        },
        {
          "step5": "Once your desired texture is reached, let your jerky 'rest' until it reaches room temperature. At this point, it has reached its final texture and is ready for consumption and packaging."
        }
      ]
    },
    {
      "items": [
        "Beef Rump Roast",
        "Chuck Roast",
        "Sea Salt",
        "Coconut Oil",
        "Bone Broth",
        "Beef Broth"
      ],
      "recipeName": "Shredded Beef",
      "ingredients": [
        "3-4 lb of beef rump roast or chuck roast",
        "1 tsp sea salt",
        "2 tbsp coconut oil",
        "2 1/2 cups of bone broth or beef broth"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Cut the roast into 4 even pieces and season all sides with salt."
        },
        {
          "step2": "Set Instant Pot to the Sauté setting and heat coconut oil in the pot for 10 minutes."
        },
        {
          "step3": "Add the roast pieces and brown on all sides, about 10 minutes."
        },
        {
          "step3": "Press Cancel, and add the broth over the beef. Close the lid and make sure the pressure-release valve is closed."
        },
        {
          "step3": "Cook at high pressure on Manual for 50 minutes. Once the Instant Pot beeps to signal that it's done, let it sit for 10-15 minutes to allow the pressure to release naturally until the lid opens."
        },
        {
          "step3": "Transfer the roast to a cutting board, and shred the meat with 2 forks. Return to the Instant Pot and keep warm until ready to use."
        },
        {
          "step3": "You can eat the shredded beef on its own with various sides, or use in other dishes like tacos, burrito bowls, stir-fry, sandwiches, and more."
        }
      ]
    },
    {
      "items": ["Ground Beef", "Red Kidney Beans", "Salsa", "Tomato Juice"],
      "recipeName": "Beef Chili",
      "ingredients": [
        "1 1/2 lbs ground beef",
        "2 (15 oz cans) red kidney beans",
        "1 (24 oz jar) ANY brand jarred salsa",
        "1 cup tomato juice"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "For crockpot owners, brown the ground beef and transfer to a slow cooker. Add in the beans along with the salsa and tomato juice. Turn on low for 4-6 hours. If using dried beans that have been soaked per package instructions then increase cooking time to 6-8 hours on low."
        },
        {
          "step2": "For stove-top users, brown the ground beef and add in canned drained beans instead of soaked dried beans (cooking time will take much faster with canned beans.) Add in the salsa and tomato juice and simmer 30-45 minutes, adding more tomato juice if too thick."
        }
      ]
    },
    {
      "items": [
        "Olive Oil",
        "Round Beef Roast",
        "Frozen Stew Vegetables",
        "Savory Pot Roast Seasoning Mix"
      ],
      "recipeName": "Slow Cooker Beef Shoulder Roast",
      "ingredients": [
        "2 tablespoons olive oil",
        "1 (3-pound) boneless top round beef roast",
        "1 package (16 ounces) frozen stew vegetables",
        "1 package (1.3 ounces) slow cooker savory pot roast seasoning mix"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "In a large skillet, heat oil over medium-high heat; add roast and cook 10 minutes, turning to sear all sides."
        },
        {
          "step2": "Place vegetables in a 5- to 6-quart slow cooker; place roast on top of vegetables. In a small bowl, stir seasoning and 1 cup water; pour over roast and vegetables. Cover and cook on high for 5 to 6 hours or on low for 10 to 12 hours or until beef is very tender."
        }
      ]
    },
    {
      "items": ["Onion Soup Mix", "Pork Chop", "Flour", "Olive Oil"],
      "recipeName": "Onion Pan-Fried Pork Chops",
      "ingredients": [
        "1 (1 ounce) envelope dry onion soup mix",
        "2 pork chops",
        "1/4 cup all-purpose flour",
        "1 cup olive oil for frying"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Before opening the onion soup mix, use your hands to crush the larger bits of onion in the packet. Open the packet, and pour the mix into a shallow bowl. Stir in the flour."
        },
        {
          "step2": "Heat the oil in a heavy skillet over medium heat. The oil is hot enough when a pinch of the flour mixture sizzles when tossed into the oil. Coat pork chops in the onion soup mixture, and shake off the excess. Carefully place in the hot oil. Turn chops over after about 30 seconds to quickly sear both sides. Cook for about 4 minutes per side, or to the desired degree of doneness."
        }
      ]
    },
    {
      "items": [
        "Cooking Spray",
        "Bulk Pork Sausage",
        "Cream Cheese",
        "Crescent Roll"
      ],
      "recipeName": "Simple Sausage Casserole",
      "ingredients": [
        "Cooking spray",
        "1 pound bulk pork sausage",
        "8 ounces cream cheese (softened)",
        "2 (8 ounce) cans refrigerated crescent rolls"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Gather all ingredients."
        },
        {
          "step2": "Preheat the oven to 350 degrees F (175 degrees C). Grease the bottom of a 9x11-inch baking dish with cooking spray."
        },
        {
          "step3": "Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease. Stir in cream cheese until combined."
        },
        {
          "step4": "Roll crescent roll dough from 1 can into the bottom of the prepared baking dish without separating. Bake in the preheated oven for 5 minutes."
        },
        {
          "step5": "Spread sausage mixture over baked crescent rolls; top with crescent roll dough from the remaining can."
        },
        {
          "step6": "Continue baking until the top layer is golden brown, about 8 minutes."
        }
      ]
    },
    {
      "items": [
        "Italian Salad Dressing",
        "Soy Sauce",
        "Black Pepper",
        "Pork Chop"
      ],
      "recipeName": "Yummy Pork Chops",
      "ingredients": [
        "2 cups Italian-style salad dressing",
        "1/4 cup soy sauce",
        "1/2 teaspoon pepper",
        "4 boneless pork chops"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Gather all ingredients."
        },
        {
          "step2": "Preheat the oven to 350 degrees F (175 degrees C). Grease the bottom of a 9x11-inch baking dish with cooking spray."
        },
        {
          "step3": "Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease. Stir in cream cheese until combined."
        },
        {
          "step4": "Roll crescent roll dough from 1 can into the bottom of the prepared baking dish without separating. Bake in the preheated oven for 5 minutes."
        },
        {
          "step5": "Spread sausage mixture over baked crescent rolls; top with crescent roll dough from the remaining can."
        },
        {
          "step6": "Continue baking until the top layer is golden brown, about 8 minutes."
        }
      ]
    },
    {
      "items": ["Ketchup", "Beer", "Brown Sugar", "Pork Chop"],
      "recipeName": "Pork Chops in Beer",
      "ingredients": [
        "2 cups ketchup",
        "1 (12 fluid ounce) can or bottle beer",
        "3/4 cup packed brown sugar",
        "8 pork chops"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Preheat oven to 350 degrees F (175 degrees C)."
        },
        {
          "step2": "In a medium bowl, combine the ketchup, brown sugar, and beer. Mix well and pour into a 9x13-inch baking dish. Place the pork chops over this mixture in the dish."
        },
        {
          "step3": "Bake, uncovered, at 350 degrees F (175 degrees C) for 1 hour, or until the internal pork temperature reaches 145 degrees F (63 degrees C). (Note: Place foil over pork chops if they start to brown too quickly.)"
        }
      ]
    },
    {
      "items": [
        "Pork Chop",
        "Cream of Condensed Mushroom Soup",
        "Golden Mushroom Soup",
        "French Onion Soup"
      ],
      "recipeName": "Oven Baked Mushroom Pork Chops",
      "ingredients": [
        "2 lbs boneless pork chops",
        "10.5 oz can cream of mushroom soup",
        "10.75 oz can golden mushroom soup",
        "10.75 oz can French onion soup"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "5 minutes to put together, plus however long it takes your oven to preheat to 400 degrees Fahrenheit."
        },
        {
          "step2": "Cooking Time: 40 to 45 minutes at 400 degrees Fahrenheit (Use a meat thermometer to make sure your chops reach 145 degrees Fahrenheit.)"
        }
      ]
    },
    {
      "items": ["Pork Loin Roast", "Garlic", "Seasoned Salt", "Black Pepper"],
      "recipeName": "Pork Roast",
      "ingredients": [
        "1 (3- to 5-pound) boneless pork loin roast, or 1 (4- to 5-pound) bone-in pork loin roast",
        "2 cloves garlic, halved",
        "1 teaspoon seasoned salt",
        "Freshly ground black pepper, to taste"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Gather the ingredients."
        },
        {
          "step2": "Preheat the oven to 425 F. Place a rack in a shallow, foil-lined roasting pan or 13 x 9 x 2-inch baking pan."
        },
        {
          "step3": "Place the pork loin roast on the rack and rub all sides of the pork with the cut sides of the pieces of garlic. Sprinkle all sides of roast evenly with the seasoned salt and freshly ground black pepper."
        },
        {
          "step4": "Roast the pork uncovered for about 20 to 25 minutes per pound, or until the internal temperature of the roast when using an instant-read thermometer is at least 145 F."
        },
        {
          "step5": "Tent the roast loosely with foil and let it rest for 10 to 15 minutes before slicing."
        },
        {
          "step6": "Tent the roast loosely with foil and let it rest for 10 to 15 minutes before slicing."
        }
      ]
    },
    {
      "items": [
        "Pork Chop",
        "Ranch Seasoning",
        "Cream of Condensed Chicken Soup",
        "Cream of Condensed Mushroom Soup"
      ],
      "recipeName": "Crock Pot Pork Chop",
      "ingredients": [
        "Pork Chops (boneless or bone-in)",
        "Ranch Seasoning",
        "Cream of Chicken Soup",
        "Cream of Mushroom Soup"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Spray the slow cooker with cooking spray. Place pork chops in the slow cooker."
        },
        {
          "step2": "Sprinkle ranch dressing powder evenly over the pork chops (front and back)."
        },
        {
          "step3": "Combine soups in a bowl and stir. Pour evenly over pork chops. Cook on low heat for 6-8 hours (or high heat for about 3-4 hours)."
        },
        {
          "step4": "Remove pork chops and use the gravy to pour over a side of mashed potatoes, rice, or egg noodles."
        }
      ]
    },
    {
      "items": ["Pork Chop", "Olive Oil", "Soy Sauce", "Italian Seasoning"],
      "recipeName": "Oven Baked Pork Chops",
      "ingredients": [
        "Pork chops",
        "Olive oil",
        "Soy sauce",
        "Italian seasoning"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Marinate the pork chops. Pat dry the pork chops using paper towels and season with salt and pepper. Add the olive oil, soy sauce, and Italian seasoning into a zip-lock bag and mix well. Add the pork chops and push out as much air as you can. Allow the meat to sit in the marinade for 10 minutes."
        },
        {
          "step2": "Preheat the oven to 180°C/350°F degrees. Remove the pork chops from the marinade and arrange them on a lined baking sheet. Bake for 17 to 20 minutes, flipping the pork chops halfway through baking. Once baked, remove the pork chops from the oven and allow them to rest for 5 minutes before serving."
        }
      ]
    },
    {
      "items": ["Pork Leg", "Olive Oil", "Lemon Juice", "Apple"],
      "recipeName": "Roast Pork with Apples",
      "ingredients": [
        "1.5 kg boned and rolled pork leg",
        "1 tablespoon olive oil",
        "1 lemon juiced",
        "6 Red Delicious or Pink Lady apples"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Preheat oven to 220°C."
        },
        {
          "step2": "Using a sharp knife, score the pork skin, all the way around, from one side to the other in 1cm parallel lines."
        },
        {
          "step3": "Brush the skin generously first with olive oil then with lemon juice."
        },
        {
          "step4": "Then rub the entire leg with 2 teaspoons of sea salt, rubbing it in well."
        },
        {
          "step5": "Place the pork onto a rack in a large paper-lined baking dish and roast for 30 minutes."
        },
        {
          "step6": "Reduce heat to 180°C and roast for a further 30 minutes."
        },
        {
          "step7": "Lightly brush the apples with a little olive oil and season with sea salt and cracked pepper."
        },
        {
          "step8": "Arrange in the roasting pan with the pork and roast for 30 minutes or until the pork is just cooked and the skin is crispy crackling."
        },
        {
          "step9": "Stand for 10 minutes before carving."
        },
        {
          "step10": "Serve with the baked apples and seasonal vegetables."
        }
      ]
    },
    {
      "items": [
        "Pork Chop",
        "Italian Salad Dressing",
        "Brown Sugar",
        "Dijon Mustard"
      ],
      "recipeName": "Dump-and-Go 4-Ingredient Baked Pork Chops",
      "ingredients": [
        "4 thick-cut boneless pork chops",
        "1 cup Italian salad dressing",
        "1/2 cup brown sugar",
        "1/2 cup Dijon mustard"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Preheat oven to 400 degrees F. Spray a large baking dish with cooking spray and set aside."
        },
        {
          "step2": "Pat pork chops dry with a paper towel, and season on both sides with salt and pepper."
        },
        {
          "step3": "Place pork chops in the prepared baking dish."
        },
        {
          "step4": "In a large measuring cup or bowl, whisk together salad dressing, brown sugar, and Dijon mustard. Pour over pork chops."
        },
        {
          "step5": "Bake uncovered until pork is slightly pink inside, reaching an internal temperature of at least 145 degrees F – about 20 minutes (use a meat thermometer to make it really easy!). I like to put the pork under the broiler for the final 3-4 minutes so that it gets a bit crispy on the top, but that step is totally optional."
        },
        {
          "step6": "Loosely cover pork with foil and allow to rest for at least 5-10 minutes."
        },
        {
          "step7": "Garnish with fresh parsley just before serving."
        }
      ]
    },
    {
      "items": ["Fish", "Flour", "Egg", "Bread Crumbs"],
      "recipeName": "Fish Fingers",
      "ingredients": ["Fish", "Flour", "Eggs", "Breadcrumbs"],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Mix your flour in a bowl with salt and pepper."
        },
        {
          "step2": "Beat your eggs in a separate bowl."
        },
        {
          "step3": "Add your breadcrumbs into another."
        },
        {
          "step4": "One at a time, take your fingers-shaped fillets and dip them into the flour, then the eggs, then the breadcrumbs."
        },
        {
          "step5": "Place on a lined baking tray and bake in a preheated oven for 20 minutes at 180°C until golden brown and cooked through."
        }
      ]
    },
    {
      "items": ["Broccoli", "Ramen Noodles", "Tuna", "Cheese"],
      "recipeName": "Dorm Room Cheesy Tuna and Noodles",
      "ingredients": [
        "5 broccoli",
        "1 (3 ounce) package any flavor ramen noodles",
        "1 (3 ounce) can water-packed tuna, drained",
        "2 slices cheese"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Pour water into a microwave-safe bowl, and cook in the microwave until very hot, about 2 minutes at high heat."
        },
        {
          "step2": "Add ramen noodles, and microwave 2 minutes more to cook."
        },
        {
          "step3": "Drain and discard water from noodles, then stir in seasoning packet, tuna, and American cheese."
        },
        {
          "step4": "Place back into the microwave, and cook until hot, 1 to 2 minutes more."
        },
        {
          "step5": "Stir before serving."
        }
      ]
    },
    {
      "items": [
        "Canned Tuna",
        "Mayonnaise",
        "Sweet Pickled Relish",
        "Crackers"
      ],
      "recipeName": "Tuna Salad & Crackers",
      "ingredients": [
        "6-ounce can tuna in water, drained",
        "3 Tablespoons mayonnaise",
        "2 teaspoons sweet pickle relish",
        "Crackers"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Mix tuna, mayo, pickle relish, and salt until well combined."
        },
        {
          "step2": "Transfer to 4 or 8 ounce jars to pack in lunches."
        }
      ]
    },
    {
      "items": [
        "Coconut Milk",
        "Shrimp",
        "Garlic",
        "Pepper Leaves",
        "Green Leafy Vegetables"
      ],
      "recipeName": "Shrimp in Coconut Milk (Ginataang Hipon)",
      "ingredients": [
        "2 cups coconut milk",
        "2 pounds shrimp",
        "3 garlic cloves",
        "1 cup pepper leaves or any green leafy vegetable in season"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "In a medium pot, bring coconut milk and water to a boil."
        },
        {
          "step2": "Add shrimp."
        },
        {
          "step3": "Season with salt and pepper."
        },
        {
          "step4": "Add pepper leaves or other leafy vegetable just before turning off heat. Serve hot."
        }
      ]
    },
    {
      "items": ["Butter", "White Fish", "Soy Sauce", "Garlic"],
      "recipeName": "White Fish (Tilapia)",
      "ingredients": [
        "5g butter",
        "1 white fish (tilapia)",
        "1 tablespoon light soy sauce",
        "1 clove garlic"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Remove fish scales and wash them well. Put the fish in a bowl, add black pepper, light soy sauce, and garlic. Marinate it for 20 minutes."
        },
        {
          "step2": "Heat a wok with butter, add the fish."
        },
        {
          "step3": "Fry the fish under the middle heat for 3 minutes. Turn over the fish, fry for another 3 minutes until golden. Transfer it on a plate and serve."
        }
      ]
    },
    {
      "items": ["Fish Fillet", "Flour", "Egg", "Lime Juice"],
      "recipeName": "Fish Fillet in Batter",
      "ingredients": ["Filleted fish", "Flour", "Eggs", "Lime juice"],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Stir the eggs in a bowl."
        },
        {
          "step2": "Then varnish the fillets with the lemon, season them, and then pass them through flour."
        },
        {
          "step3": "Pass the fillets through egg and then again through flour."
        },
        {
          "step4": "Once they are well browned, heat the pan with the olive oil and until the oil is hot, add the fillets."
        },
        {
          "step5": "Wait for it to brown well on one side and then turn it over and serve it."
        }
      ]
    },
    {
      "items": ["White Fish Fillet", "Olive Oil", "Soy Sauce", "Garlic"],
      "recipeName": "Easy Grilled Whitefish Recipe",
      "ingredients": [
        "20 oz whitefish fillets",
        "4 tbsp olive oil, plus more for brushing",
        "1/2 cup soy sauce",
        "4 tbsp garlic, minced"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Combine the garlic and the soy sauce in a bowl."
        },
        {
          "step2": "Marinate the fillets in the marinade for 15 minutes to 20 minutes."
        },
        {
          "step3": "Prepare the grill by setting it to high heat. Brush the surface with olive oil. Use a pastry brush."
        },
        {
          "step4": "Remove from the marinade the brush with olive oil."
        },
        {
          "step5": "Place the fillets on the hot grill skin side up."
        },
        {
          "step6": "Cook for 2 to 3 minutes and then flip the fillets over."
        },
        {
          "step7": "Cook for another 3 to 5 minutes until the fish is slightly opaque."
        },
        {
          "step8": "Serve alongside steamed rice and any grilled vegetable of your choice. You may also garnish with some fresh dill. Enjoy!"
        }
      ]
    },
    {
      "items": ["Mussel", "Butter", "White Wine", "Garlic"],
      "recipeName": "Mussels Sauteed in Butter and White Wine",
      "ingredients": [
        "Mussels - 14 oz (400 g) boiled",
        "Butter - 2/5 cup (100 g)",
        "White wine - 3 - 4 tablespoons",
        "Garlic"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "Clean the mussels and put them in a suitable cooking container. Add the butter and white wine."
        },
        {
          "step2": "Cover the container and leave it on low heat until the mussels take in the sauce, while stirring periodically. Season with salt."
        },
        {
          "step3": "Serve with a suitable beverage."
        }
      ]
    },
    {
      "items": ["Baby Octopus", "Sweet Chili Sauce", "Lemon Juice", "Salt"],
      "recipeName": "Chilli garlic octopus",
      "ingredients": [
        "1 kilogram baby octopus, cleaned",
        "1/2 cup (125 millilitres) sweet chilli sauce",
        "2 tablespoons lemon juice",
        "4 cloves garlic, crushed"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/239137/three-ingredient-baked-chicken-breasts/",
      "steps": [
        {
          "step1": "In a large bowl, combine all ingredients."
        },
        {
          "step2": "Cook, in batches, on a heated oiled grill plate (or grill or barbecue) until octopus is tender."
        }
      ]
    },
    {
      "items": [
        "Chicken Stuffing Mix",
        "Cooked Chicken",
        "Broccoli",
        "Cream of Condensed Broccoli Cheese Soup",
        "Cheddar Cheese"
      ],
      "recipeName": "Contest-Winning Broccoli Chicken Casserole",
      "ingredients": [
        "1 package (6 ounces) chicken stuffing mix",
        "2 cups cubed cooked chicken",
        "1 cup frozen broccoli florets, thawed",
        "1 can (10-3/4 ounces) condensed broccoli cheese soup, undiluted",
        "1 cup shredded cheddar cheese"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/simple-salsa-chicken/",
      "steps": [
        {
          "step1": "Prepare the chicken stuffing mix according to the package instructions."
        },
        {
          "step2": "In a large mixing bowl, combine the cubed cooked chicken, thawed broccoli florets, and condensed broccoli cheese soup."
        },
        {
          "step3": "Spread the chicken and broccoli mixture in a greased casserole dish."
        },
        {
          "step4": "Top the casserole with the prepared stuffing and shredded cheddar cheese."
        },
        {
          "step5": "Bake in a preheated oven at 350°F (175°C) for about 30 minutes or until the casserole is heated through and the cheese is bubbly. Serve and enjoy!"
        }
      ]
    },
    {
      "items": [
        "Red Jalapeno Pepper Jelly",
        "Lime Juice",
        "Salt",
        "Black Pepper",
        "Chicken Drumstick"
      ],
      "recipeName": "Jalapeno-Lime Chicken Drumsticks",
      "ingredients": [
        "1 jar (10 ounces) red jalapeno pepper jelly",
        "1/4 cup lime juice",
        "1 teaspoon salt",
        "1/2 teaspoon pepper",
        "12 chicken drumsticks (about 3 pounds)"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/jalapeno-lime-chicken-drumsticks/",
      "steps": [
        {
          "step1": "In a bowl, combine the red jalapeno pepper jelly and lime juice. Mix well."
        },
        {
          "step2": "Add salt and pepper to the mixture. Stir until the seasonings are well incorporated."
        },
        {
          "step3": "Place the chicken drumsticks in a large resealable plastic bag. Pour the marinade over the drumsticks."
        },
        {
          "step4": "Seal the bag and refrigerate for at least 4 hours or overnight, turning the bag occasionally to ensure even marinating."
        },
        {
          "step5": "Preheat the grill to medium-high heat. Remove the chicken from the marinade and grill for 15-20 minutes, turning occasionally, until the drumsticks are cooked through."
        }
      ]
    },
    {
      "items": [
        "Chicken Wing",
        "Barbeque Sauce",
        "Soy Sauce",
        "Green Onion",
        "Sesame Seeds"
      ],
      "recipeName": "Slow-Cooker Sticky Chicken Wings",
      "ingredients": [
        "4 pounds chicken wings",
        "1 cup barbecue sauce",
        "1 cup soy sauce",
        "6 green onions, chopped, divided",
        "1 tablespoon sesame seeds"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/slow-cooker-sticky-chicken-wings",
      "steps": [
        {
          "step1": "In a large bowl, combine barbecue sauce, soy sauce, and half of the chopped green onions. Mix well."
        },
        {
          "step2": "Place the chicken wings in a slow cooker. Pour the sauce mixture over the chicken wings."
        },
        {
          "step3": "Cover and cook on low for 4-5 hours or until the chicken wings are tender and cooked through."
        },
        {
          "step4": "Preheat your oven broiler. Transfer the cooked chicken wings to a baking sheet lined with aluminum foil."
        },
        {
          "step5": "Brush the chicken wings with the sauce from the slow cooker and broil for a few minutes until they become sticky and slightly charred."
        },
        {
          "step6": "Serve the sticky chicken wings garnished with the remaining chopped green onions and sesame seeds."
        }
      ]
    },
    {
      "items": [
        "Chicken Breast",
        "Salt",
        "Salsa",
        "Taco Sauce",
        "Mexican Cheese Blend"
      ],
      "recipeName": "Baked Salsa Chicken",
      "ingredients": [
        "2 boneless skinless chicken breast halves (5 ounces each)",
        "1/8 teaspoon salt",
        "1/3 cup salsa",
        "2 tablespoons taco sauce",
        "1/3 cup shredded Mexican cheese blend"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/simple-salsa-chicken/",
      "steps": [
        {
          "step1": "Preheat your oven to 375°F (190°C)."
        },
        {
          "step2": "Season the chicken breast halves with salt and place them in a baking dish."
        },
        {
          "step3": "In a bowl, mix the salsa and taco sauce. Pour this sauce mixture over the chicken breasts."
        },
        {
          "step4": "Bake in the preheated oven for about 25-30 minutes or until the chicken is no longer pink in the center."
        },
        {
          "step5": "Remove the baking dish from the oven and sprinkle the shredded Mexican cheese blend over the chicken. Return to the oven and bake for an additional 5 minutes or until the cheese is melted and bubbly."
        },
        {
          "step6": "Serve the baked salsa chicken hot, garnished with extra salsa if desired."
        }
      ]
    },
    {
      "items": [
        "Chicken Breast",
        "Cider Vinegar",
        "Canola Oil",
        "Worcestershire Sauce",
        "Hot Pepper Sauce"
      ],
      "recipeName": "Kentucky Grilled Chicken",
      "ingredients": [
        "10 bone-in chicken breast halves (10 ounces each)",
        "1 cup cider vinegar",
        "1/2 cup canola oil",
        "5 teaspoons Worcestershire sauce",
        "4 teaspoons hot pepper sauce"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/kentucky-grilled-chicken/",
      "steps": [
        {
          "step1": "In a large bowl, mix the cider vinegar, canola oil, Worcestershire sauce, and hot pepper sauce to create the marinade."
        },
        {
          "step2": "Place the chicken breast halves in a large resealable plastic bag. Pour the marinade over the chicken and seal the bag. Refrigerate for at least 4 hours or overnight."
        },
        {
          "step3": "Preheat your grill to medium heat."
        },
        {
          "step4": "Remove the chicken from the marinade and grill for about 6-8 minutes on each side or until the chicken is no longer pink and has nice grill marks."
        },
        {
          "step5": "Serve the grilled Kentucky chicken hot, garnished with your favorite side dishes."
        }
      ]
    },
    {
      "items": [
        "Chicken Breast",
        "Caesar Salad Dressing",
        "Olive Oil",
        "Dijon Mustard",
        "Garlic"
      ],
      "recipeName": "Grilled Caesar Chicken Breasts",
      "ingredients": [
        "4 boneless skinless chicken breast halves (6 ounces each)",
        "1/2 cup creamy Caesar salad dressing",
        "3 tablespoons olive oil",
        "3 tablespoons Dijon mustard",
        "6 garlic cloves, minced"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/grilled-caesar-chicken-breasts/",
      "steps": [
        {
          "step1": "In a bowl, combine the creamy Caesar salad dressing, olive oil, Dijon mustard, and minced garlic cloves. Mix well to create the marinade."
        },
        {
          "step2": "Place the chicken breast halves in a large resealable plastic bag. Pour the marinade over the chicken and seal the bag. Refrigerate for at least 30 minutes to marinate."
        },
        {
          "step3": "Preheat your grill to medium-high heat."
        },
        {
          "step4": "Remove the chicken from the marinade and grill for about 6-8 minutes on each side or until the chicken is no longer pink in the center."
        },
        {
          "step5": "Serve the grilled Caesar chicken breasts hot, garnished with your favorite sides and extra Caesar dressing if desired."
        }
      ]
    },
    {
      "items": [
        "Chicken Breast",
        "Sherry Broth",
        "Chicken Broth",
        "Soy Sauce",
        "Garlic",
        "Ground Ginger"
      ],
      "recipeName": "Grilled Teriyaki Chicken",
      "ingredients": [
        "2 boneless skinless chicken breast halves (6 ounces each)",
        "1/4 cup sherry or chicken broth",
        "1/4 cup reduced-sodium soy sauce",
        "2 garlic cloves, minced",
        "1/2 teaspoon ground ginger"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/grilled-teriyaki-chicken/",
      "steps": [
        {
          "step1": "In a small bowl, mix together the sherry or chicken broth, reduced-sodium soy sauce, minced garlic, and ground ginger to create the teriyaki marinade."
        },
        {
          "step2": "Place the chicken breast halves in a resealable plastic bag or a shallow dish. Pour the teriyaki marinade over the chicken and seal the bag or cover the dish. Refrigerate for at least 30 minutes to marinate."
        },
        {
          "step3": "Preheat your grill to medium-high heat."
        },
        {
          "step4": "Remove the chicken from the marinade and grill for about 6-8 minutes on each side or until the chicken is no longer pink in the center, and the internal temperature reaches 165°F (75°C)."
        }
      ]
    },
    {
      "items": [
        "Chicken Leg Quarter",
        "Tomato Sauce",
        "Soy Sauce",
        "Brown Sugar",
        "Garlic"
      ],
      "recipeName": "Soy-Garlic Chicken",
      "ingredients": [
        "6 chicken leg quarters, skin removed",
        "1 can (8 ounces) tomato sauce",
        "1/2 cup reduced-sodium soy sauce",
        "1/4 cup packed brown sugar",
        "2 teaspoons minced garlic"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/soy-garlic-chicken/",
      "steps": [
        {
          "step1": "In a mixing bowl, combine the tomato sauce, reduced-sodium soy sauce, brown sugar, and minced garlic to create the soy-garlic sauce."
        },
        {
          "step2": "Place the chicken leg quarters in a large resealable plastic bag or a shallow dish. Pour the soy-garlic sauce over the chicken, seal the bag or cover the dish, and refrigerate for at least 1 hour to marinate."
        },
        {
          "step3": "Preheat your grill to medium-high heat."
        },
        {
          "step4": "Remove the chicken from the marinade and grill for about 35-40 minutes, turning occasionally, until the chicken is cooked through and reaches an internal temperature of 165°F (75°C). Baste with the marinade during grilling."
        }
      ]
    },
    {
      "items": [
        "Broiler Chicken",
        "Fryer Chicken",
        "Olive Oil",
        "Flour",
        "Onion Soup Mix",
        "Beer",
        "Non-alcoholic Beer"
      ],
      "recipeName": "Savory Onion Chicken",
      "ingredients": [
        "1 broiler/fryer chicken (3 to 4 pounds), cut up and skin removed",
        "2 tablespoons olive oil",
        "1/4 cup all-purpose flour, divided",
        "1 envelope onion soup mix",
        "1 bottle (12 ounces) beer or nonalcoholic beer"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/savory-onion-chicken/",
      "steps": [
        {
          "step1": "In a large resealable plastic bag, combine 2 tablespoons of flour, onion soup mix, and a dash of pepper."
        },
        {
          "step2": "Add the chicken pieces to the bag and shake to coat the chicken with the flour mixture."
        },
        {
          "step3": "In a large skillet, heat the olive oil over medium-high heat. Brown the chicken pieces on all sides."
        },
        {
          "step4": "Place the browned chicken in a slow cooker and pour beer over it. Cover and cook on LOW for 6-7 hours until the chicken is tender and thoroughly cooked."
        }
      ]
    },
    {
      "items": [
        "Chicken Breast",
        "Cream of Condensed Chicken Soup",
        "White Wine",
        "Chicken Broth",
        "Swiss Cheese",
        "Croutons"
      ],
      "recipeName": "Baked Swiss Chicken",
      "ingredients": [
        "6 boneless skinless chicken breast halves (6 ounces each)",
        "1 can (10-3/4 ounces) condensed cream of chicken soup, undiluted",
        "1/2 cup white wine or chicken broth",
        "6 slices Swiss cheese",
        "1 cup crushed seasoned croutons"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/baked-swiss-chicken/",
      "steps": [
        {
          "step1": "Preheat your oven to 350°F (175°C)."
        },
        {
          "step2": "In a bowl, mix together the condensed cream of chicken soup and white wine or chicken broth."
        },
        {
          "step3": "Place the chicken breast halves in a greased baking dish. Pour the soup mixture over the chicken."
        },
        {
          "step4": "Lay a slice of Swiss cheese on top of each chicken breast."
        },
        {
          "step5": "Sprinkle the crushed seasoned croutons evenly over the cheese."
        },
        {
          "step6": "Bake in the preheated oven for 30-35 minutes or until the chicken is cooked through, and the topping is golden and bubbly."
        }
      ]
    },
    {
      "items": [
        "Olive Oil",
        "Fajita Vegetables",
        "Black Beans",
        "Southwest-style Seasoning Blend",
        "Salt"
      ],
      "recipeName": "Black Bean Fajita Skillet",
      "ingredients": [
        "1 tablespoon olive oil",
        "1 package sliced fajita vegetables (bell peppers and onions)",
        "1 can no-salt-added black beans, rinsed",
        "1/2 salt-free Southwest-style seasoning blend",
        "1/4 teaspoon salt"
      ],
      "websiteLink": "https://www.eatingwell.com/recipe/7886570/black-bean-fajita-skillet/",
      "steps": [
        {
          "step1": "In a large skillet, heat the olive oil over medium heat."
        },
        {
          "step2": "Add the sliced fajita vegetables to the skillet and sauté until they become tender and slightly caramelized."
        },
        {
          "step3": "Stir in the no-salt-added black beans, salt-free Southwest-style seasoning blend, and a pinch of salt. Continue to cook, stirring, until the beans are heated through and the flavors are well combined."
        },
        {
          "step4": "Taste and adjust the seasoning as needed, adding more salt or seasoning blend if desired."
        },
        {
          "step5": "Serve the black bean fajita skillet hot and enjoy!"
        }
      ]
    },
    {
      "items": [
        "Kale",
        "Salt",
        "Black Pepper",
        "Marinara Sauce",
        "Tomato Sauce",
        "Egg"
      ],
      "recipeName": "Baked Eggs in Tomato Sauce with Kale",
      "ingredients": [
        "3 10-ounce packages frozen chopped kale",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground pepper",
        "1 25-ounce jar low-sodium marinara sauce or 3 cups canned low-sodium tomato sauce",
        "8 large eggs"
      ],
      "websiteLink": "https://www.eatingwell.com/recipe/264141/baked-eggs-in-tomato-sauce-with-kale/",
      "steps": [
        {
          "step1": "Preheat your oven to 375°F (190°C)."
        },
        {
          "step2": "In a large skillet, heat the low-sodium marinara sauce or canned tomato sauce over medium heat."
        },
        {
          "step3": "Add the frozen chopped kale to the sauce and stir in the salt and ground pepper. Cook until the kale is thawed and heated through."
        },
        {
          "step4": "Make eight small wells in the sauce and kale mixture using a spoon. Crack an egg into each well."
        },
        {
          "step5": "Transfer the skillet to the preheated oven and bake until the egg whites are set but the yolks are still runny, about 10-15 minutes. Season with additional salt and pepper to taste, if desired."
        }
      ]
    },
    {
      "items": [
        "Cheese Ravioli",
        "Olive Oil",
        "Grape Tomatoes",
        "Baby Spinach",
        "Pesto"
      ],
      "recipeName": "Pesto Ravioli with Spinach & Tomatoes",
      "ingredients": [
        "2 8-ounce packages frozen or refrigerated cheese ravioli",
        "1 tablespoon olive oil",
        "1 pint grape tomatoes",
        "1 5-ounce package baby spinach",
        "⅓ cup pesto"
      ],
      "websiteLink": "https://www.eatingwell.com/recipe/274007/pesto-ravioli-with-spinach-tomatoes/",
      "steps": [
        {
          "step1": "Cook the cheese ravioli according to the package instructions. Drain and set aside."
        },
        {
          "step2": "In a large skillet, heat olive oil over medium heat. Add the grape tomatoes and cook until they start to blister and soften."
        },
        {
          "step3": "Add the baby spinach to the skillet and cook until wilted."
        },
        {
          "step4": "Toss the cooked ravioli and pesto into the skillet with the tomatoes and spinach. Stir to combine and heat through."
        },
        {
          "step5": "Serve the Pesto Ravioli with Spinach & Tomatoes immediately and enjoy."
        }
      ]
    },
    {
      "items": [
        "Sun-dried Tomatoes",
        "Cooking Oil",
        "Chickpeas",
        "Kale",
        "Water"
      ],
      "recipeName": "3-Ingredient Chickpeas with Kale & Sun-Dried Tomatoes",
      "ingredients": [
        "¼ cup slivered oil-packed sun-dried tomatoes",
        "1 tablespoon oil from the jar",
        "1 can no-salt-added chickpeas",
        "1 package chopped kale",
        "⅓ cup water"
      ],
      "websiteLink": "https://www.eatingwell.com/recipe/7915176/3-ingredient-chickpeas-with-kale-sun-dried-tomatoes/",
      "steps": [
        {
          "step1": "In a large skillet, heat the oil from the jar of sun-dried tomatoes over medium heat."
        },
        {
          "step2": "Add the sun-dried tomatoes and cook for a few minutes until they become fragrant and slightly crispy."
        },
        {
          "step3": "Add the chickpeas to the skillet and sauté until they are heated through."
        },
        {
          "step4": "Stir in the chopped kale and water. Cover the skillet and cook until the kale wilts and becomes tender."
        },
        {
          "step5": "Serve the 3-Ingredient Chickpeas with Kale & Sun-Dried Tomatoes immediately and enjoy."
        }
      ]
    },
    {
      "items": [
        "Brussels Sprout",
        "Parmesan Cheese",
        "Olive Oil",
        "Lemon Juice",
        "Pine Nuts",
        "Sunflower Seeds"
      ],
      "recipeName": "Shaved Brussels Sprouts with Parmesan & Lemon",
      "ingredients": [
        "1 pound of Brussels sprouts",
        "2 ounces parmesan cheese",
        "3 tablespoons olive oil",
        "2 tablespoons of lemon juice",
        "2 tablespoons pine nuts or sunflower seeds"
      ],
      "websiteLink": "https://iheartvegetables.com/shaved-brussels-sprouts-parmesan-lemon/",
      "steps": [
        {
          "step1": "Begin by trimming the ends of the Brussels sprouts and removing any damaged outer leaves."
        },
        {
          "step2": "Using a sharp knife or a food processor with a slicing attachment, thinly shave the Brussels sprouts."
        },
        {
          "step3": "In a large bowl, combine the shaved Brussels sprouts, grated parmesan cheese, and pine nuts or sunflower seeds."
        },
        {
          "step4": "Drizzle the olive oil and lemon juice over the mixture. Toss everything together to coat the ingredients evenly."
        },
        {
          "step5": "Serve the Shaved Brussels Sprouts with Parmesan & Lemon as a side dish, and enjoy the fresh and zesty flavors."
        }
      ]
    },
    {
      "items": [
        "Green Beans",
        "Olive Oil",
        "Almonds",
        "Lemon",
        "Salt",
        "Black Pepper"
      ],
      "recipeName": "10 Minute Green Beans",
      "ingredients": [
        "1 lb green beans, washed and trimmed",
        "1 tablespoon olive oil",
        "1/4 cup slivered almonds",
        "1/2 lemon",
        "Salt & pepper to taste"
      ],
      "websiteLink": "https://iheartvegetables.com/10-minute-green-beans-recipe/",
      "steps": [
        {
          "step1": "Start by washing and trimming the green beans. Remove any stems or ends that are tough."
        },
        {
          "step2": "Heat olive oil in a large skillet over medium-high heat. Add the green beans and sauté for about 5 minutes until they become tender but still crisp."
        },
        {
          "step3": "In the last minute of cooking, add the slivered almonds to the skillet. Continue to cook, stirring, until the almonds are lightly toasted."
        },
        {
          "step4": "Squeeze the juice from half a lemon over the green beans and almonds. Toss to combine, and season with salt and pepper to taste."
        },
        {
          "step5": "Transfer the 10 Minute Green Beans to a serving dish, and enjoy this quick and delicious dish."
        }
      ]
    },
    {
      "items": [
        "Navel Orange",
        "Avocado",
        "Mixed Greens",
        "Spinach",
        "Olive Oil",
        "Almonds"
      ],
      "recipeName": "Avocado and Orange Salad",
      "ingredients": [
        "1 large navel orange segmented with juices reserved",
        "1 avocado, cut into 1” pieces",
        "4 cups of mixed greens or spinach",
        "2 tablespoons olive oil",
        "2 tablespoons sliced almonds"
      ],
      "websiteLink": "https://iheartvegetables.com/avocado-orange-salad/",
      "steps": [
        {
          "step1": "Start by segmenting the navel orange. Cut off the top and bottom of the orange, then use a knife to remove the peel and pith. Hold the orange over a bowl to catch the juices, and carefully cut between the membranes to release the segments."
        },
        {
          "step2": "In a large salad bowl, combine the orange segments, pieces of avocado, and the mixed greens or spinach."
        },
        {
          "step3": "In a small bowl, whisk together the reserved orange juice and olive oil to make the dressing."
        },
        {
          "step4": "Drizzle the dressing over the salad and toss gently to combine all the ingredients."
        },
        {
          "step5": "Sprinkle the sliced almonds on top of the salad just before serving for added crunch and flavor. Enjoy your Avocado and Orange Salad!"
        }
      ]
    },
    {
      "items": [
        "Tofu",
        "Miso Paste",
        "Maple Syrup",
        "Agave Nectar",
        "Rice Vinegar",
        "Apple Cider Vinegar",
        "Soy Sauce"
      ],
      "recipeName": "Miso Tofu",
      "ingredients": [
        "Tofu",
        "Miso Paste",
        "Maple syrup or Agave Nectar",
        "Rice vinegar or apple cider vinegar",
        "Soy sauce"
      ],
      "websiteLink": "https://thecheaplazyvegan.com/miso-tofu/",
      "steps": [
        {
          "step1": "Start by pressing the tofu to remove excess water. Place the block of tofu between paper towels or clean kitchen towels and put something heavy on top, like a cast-iron skillet. Let it press for about 15-30 minutes."
        },
        {
          "step2": "While the tofu is pressing, prepare the miso marinade. In a bowl, combine miso paste, maple syrup or agave nectar, rice vinegar or apple cider vinegar, and soy sauce. Mix well to form a smooth marinade."
        },
        {
          "step3": "After the tofu has been pressed, cut it into bite-sized cubes or slices, depending on your preference."
        },
        {
          "step4": "Place the tofu pieces in a container or a zip-top bag and pour the miso marinade over them. Ensure all tofu pieces are coated with the marinade. Seal the container or bag and refrigerate for at least 1-2 hours, allowing the tofu to marinate and absorb the flavors."
        },
        {
          "step5": "When ready to cook, preheat your oven or grill. Place the marinated tofu on skewers or a grill tray if using the grill. If using the oven, you can place the tofu on a baking sheet lined with parchment paper. Cook until the tofu is nicely browned and has a slightly crispy texture. Serve your delicious Miso Tofu with your favorite side dishes or enjoy it on its own."
        }
      ]
    },
    {
      "items": [
        "Tofu",
        "Teriyaki Sauce",
        "Cooking Oil",
        "Cornstarch",
        "Stir-fried Vegetables"
      ],
      "recipeName": "Teriyaki Stir Fry",
      "ingredients": [
        "Tofu",
        "Teriyaki Sauce",
        "Oil",
        "Cornstarch",
        "Stir Fry Vegetables"
      ],
      "websiteLink": "https://thecheaplazyvegan.com/teriyaki-tofu-stir-fry/",
      "steps": [
        {
          "step1": "Start by preparing the tofu. If you're using extra-firm tofu, press it to remove excess water. Then, cut the tofu into bite-sized cubes or strips, depending on your preference."
        },
        {
          "step2": "In a bowl, combine the teriyaki sauce and cornstarch. Mix well until the cornstarch is fully dissolved. This mixture will be used to thicken the teriyaki sauce during cooking."
        },
        {
          "step3": "In a large skillet or wok, heat the oil over medium-high heat. Once the oil is hot, add the tofu pieces and stir-fry them until they become golden brown and slightly crispy. This should take about 5-7 minutes."
        },
        {
          "step4": "Add your choice of stir-fry vegetables to the skillet. Common options include bell peppers, broccoli, snap peas, carrots, and more. Stir-fry the vegetables until they are tender-crisp, usually about 5-7 minutes."
        },
        {
          "step5": "Pour the teriyaki sauce mixture over the tofu and vegetables. Stir well to ensure everything is coated with the sauce. Cook for an additional 2-3 minutes, allowing the sauce to thicken and cling to the ingredients."
        },
        {
          "step6": "Serve your delicious Teriyaki Stir Fry over a bed of cooked rice or noodles. Garnish with sesame seeds, chopped green onions, or a drizzle of extra teriyaki sauce for added flavor."
        }
      ]
    },
    {
      "items": [
        "Tortilla",
        "Black Beans",
        "Taco Seasoning Mix",
        "Avocado",
        "Tomato"
      ],
      "recipeName": "Black Bean Breakfast Tacos",
      "ingredients": [
        "Tortillas",
        "Black beans",
        "Taco Seasoning or seasoning of choice",
        "Avocado",
        "Tomatoes"
      ],
      "websiteLink": "https://thecheaplazyvegan.com/black-bean-breakfast-tacos/",
      "steps": [
        {
          "step1": "Start by heating a non-stick skillet over medium heat. While the skillet is heating, warm the tortillas in a separate pan or in the oven. Keep them warm until you're ready to assemble the tacos."
        },
        {
          "step2": "In the skillet, add the black beans and season them with taco seasoning or your seasoning of choice. Sauté the beans until they are heated through and well-coated with the seasoning, usually about 3-5 minutes."
        },
        {
          "step3": "While the beans are cooking, prepare the toppings. Dice the avocado and tomatoes into small pieces."
        },
        {
          "step4": "Once the beans are ready, it's time to assemble the tacos. Lay out the warm tortillas and spoon the seasoned black beans onto each tortilla."
        },
        {
          "step5": "Top the beans with diced avocado and tomatoes. You can also add additional toppings like salsa, shredded cheese, sour cream, or fresh cilantro if desired."
        },
        {
          "step6": "Fold the tortillas in half, and your Black Bean Breakfast Tacos are ready to serve. Enjoy them as a quick and delicious breakfast or brunch!"
        }
      ]
    },
    {
      "items": [
        "Ground Beef",
        "Ground Turkey",
        "Original Sloppy Joe Sauce",
        "Canned Chili with Beans",
        "Hash Brown",
        "Cheddar Cheese"
      ],
      "recipeName": "Cheesy Chili Hash Brown Bake Recipe",
      "ingredients": [
        "1 1/2 pounds lean ground beef or turkey",
        "1 (15.5-oz.) can original sloppy joe sauce",
        "1 (15-oz.) can chili with beans",
        "1/2 (30-oz.) package frozen country-style shredded hash browns (about 4 cups)",
        "2 cups (8 oz.) shredded Cheddar cheese"
      ],
      "websiteLink": "https://www.southernliving.com/recipes/cheesy-chili-hash-brown-bake-recipe",
      "steps": [
        {
          "step1": "Preheat your oven to 350°F (175°C). Grease a 9x13-inch baking dish and set it aside."
        },
        {
          "step2": "In a large skillet, cook the lean ground beef or turkey over medium-high heat until it's browned and crumbled. Drain any excess fat."
        },
        {
          "step3": "Add the original sloppy joe sauce and chili with beans to the cooked meat. Stir and let the mixture simmer for a few minutes until it's heated through."
        },
        {
          "step4": "Place half of the frozen shredded hash browns in the prepared baking dish. Spoon the meat and sauce mixture over the hash browns."
        },
        {
          "step5": "Add the remaining hash browns on top of the meat. Sprinkle the shredded Cheddar cheese evenly over the casserole."
        },
        {
          "step6": "Cover the baking dish with aluminum foil and bake in the preheated oven for 45 minutes. Then, remove the foil and continue baking for an additional 15-20 minutes or until the casserole is hot and bubbly and the cheese is nicely melted and golden."
        },
        {
          "step7": "Remove from the oven and let it cool slightly before serving. Serve this Cheesy Chili Hash Brown Bake as a delicious and hearty meal."
        }
      ]
    },
    {
      "items": [
        "Shell Pasta",
        "Ground Beef",
        "Tomato Soup",
        "Cheddar Cheese",
        "Mozarella Cheese"
      ],
      "recipeName": "Hamburger Casserole",
      "ingredients": [
        "1 lb medium shell pasta",
        "1 lb ground beef",
        "2 (10 oz each) cans tomato soup",
        "1 1/2 cups cheddar cheese, grated",
        "1 1/2 cups mozzarella cheese, grated"
      ],
      "websiteLink": "https://12tomatoes.com/4-ingredient-hamburger-casserole/",
      "steps": [
        {
          "step1": "Preheat your oven to 350°F (175°C). Grease a 9x13-inch baking dish and set it aside."
        },
        {
          "step2": "Cook the medium shell pasta according to the package instructions until it's al dente. Drain and set it aside."
        },
        {
          "step3": "In a large skillet, cook the ground beef over medium-high heat until it's browned and crumbled. Drain any excess fat."
        },
        {
          "step4": "In a large mixing bowl, combine the cooked pasta, browned ground beef, and both cans of tomato soup. Mix well to evenly coat the pasta and beef."
        },
        {
          "step5": "Transfer the mixture to the prepared baking dish and spread it out evenly. Top with the grated cheddar and mozzarella cheese."
        },
        {
          "step6": "Cover the baking dish with aluminum foil and bake in the preheated oven for 30 minutes. Then, remove the foil and continue baking for an additional 10-15 minutes or until the cheese is bubbly and golden."
        },
        {
          "step7": "Remove from the oven and let it cool slightly before serving. Serve this Hamburger Casserole as a comforting and cheesy meal."
        }
      ]
    },
    {
      "items": [
        "Ground Beef",
        "Tomato",
        "Green Chili",
        "Black Beans",
        "Refried Beans",
        "Tostada Shells"
      ],
      "recipeName": "Black Bean and Beef Tostadas",
      "ingredients": [
        "1/2 pound lean ground beef (90% lean)",
        "1 can (10 ounces) diced tomatoes and green chiles, undrained",
        "1 can (15 ounces) black beans, rinsed and drained",
        "1 can (16 ounces) refried beans, warmed",
        "8 tostada shells"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/black-bean-and-beef-tostadas/",
      "steps": [
        {
          "step1": "In a large skillet, cook the lean ground beef over medium-high heat until it's browned and crumbled. Drain any excess fat."
        },
        {
          "step2": "Add the diced tomatoes and green chiles to the cooked beef. Stir and cook for a few minutes until heated through."
        },
        {
          "step3": "In a separate saucepan, warm the refried beans over low heat, stirring occasionally."
        },
        {
          "step4": "Assemble the tostadas: Spread a layer of warmed refried beans onto each tostada shell. Top with the beef and tomato mixture, followed by black beans."
        },
        {
          "step5": "Serve the tostadas as an open-faced sandwich. You can garnish with your favorite toppings like shredded lettuce, cheese, sour cream, or salsa."
        }
      ]
    },
    {
      "items": [
        "V8 Juice",
        "Mixed Veggies",
        "Cream of Condensed Mushroom Soup",
        "Ground Beef",
        "Onion"
      ],
      "recipeName": "Tomato Hamburger Soup",
      "ingredients": [
        "1 can (46 ounces) V8 juice",
        "2 packages (16 ounces each) frozen mixed vegetables",
        "1 can (10-3/4 ounces) condensed cream of mushroom soup, undiluted",
        "1 pound ground beef, cooked and drained",
        "2 teaspoons dried minced onion"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/tomato-hamburger-soup/",
      "steps": [
        {
          "step1": "In a large soup pot, combine the V8 juice and frozen mixed vegetables. Heat over medium-high heat, stirring occasionally, until the vegetables are heated through."
        },
        {
          "step2": "Stir in the condensed cream of mushroom soup and continue to heat the mixture until it's thoroughly combined and hot."
        },
        {
          "step3": "Add the cooked and drained ground beef to the soup. Mix well to incorporate the beef."
        },
        {
          "step4": "Sprinkle the dried minced onion into the soup and stir to distribute the flavor evenly."
        },
        {
          "step5": "Simmer the soup for a few minutes until all ingredients are hot and well combined. Serve and enjoy."
        }
      ]
    },
    {
      "items": [
        "Ramen Noodles",
        "Olive Oil",
        "Beef Mince",
        "Stir-fried Vegetables",
        "Teriyaki Sauce"
      ],
      "recipeName": "Teriyaki Beef Noodle Stir-fry",
      "ingredients": [
        "300g pkt Coles Kitchen Ramen Noodles",
        "1 tbsp olive oil",
        "500g Coles Extra Lean Beef Mince",
        "250g pkt superfood vegetables stir-fry mix",
        "125ml (1/2 cup) Coles Asia Teriyaki Sauce"
      ],
      "websiteLink": "https://www.taste.com.au/recipes/4-ingredient-teriyaki-beef-noodle-stir-fry-recipe/arg1scmx",
      "steps": [
        {
          "step1": "Cook the ramen noodles according to the package instructions. Drain and set aside."
        },
        {
          "step2": "Heat olive oil in a large skillet or wok over medium-high heat. Add the beef mince and stir-fry until browned and cooked through."
        },
        {
          "step3": "Add the superfood vegetables stir-fry mix to the skillet and stir-fry for a few minutes until the vegetables are tender-crisp."
        },
        {
          "step4": "Pour the teriyaki sauce over the beef and vegetable mixture. Stir well and let it simmer for a couple of minutes."
        },
        {
          "step5": "Serve the teriyaki beef and vegetable stir-fry over the cooked ramen noodles. Enjoy!"
        }
      ]
    },
    {
      "items": [
        "Ground Beef",
        "Onion",
        "Barbeque Sauce",
        "Cheddar Cheese",
        "Pepper Jack Cheese",
        "Smoked Gouda Cheese",
        "Provolone Cheese",
        "Wheat Hamburger Buns",
        "Pretzel Rolls"
      ],
      "recipeName": "Zesty Barbecue Cheeseburgers",
      "ingredients": [
        "1 pound Ground Beef (93% lean or leaner)",
        "1/4 cup finely chopped red onion",
        "4 tablespoons barbecue sauce, divided",
        "4 slices white Cheddar, pepper Jack, smoked Gouda, or provolone cheese",
        "4 whole wheat hamburger buns or pretzel rolls, split, toasted"
      ],
      "websiteLink": "https://www.beefitswhatsfordinner.com/recipes/recipe/5071/zesty-barbecue-cheeseburgers",
      "steps": [
        {
          "step1": "Preheat your grill to medium heat."
        },
        {
          "step2": "In a mixing bowl, combine the ground beef, finely chopped red onion, and 2 tablespoons of barbecue sauce."
        },
        {
          "step3": "Shape the beef mixture into 4 patties of equal size."
        },
        {
          "step4": "Grill the patties for about 7-8 minutes per side, or to your desired level of doneness."
        },
        {
          "step5": "During the last minute of grilling, place a slice of cheese on each patty and toast the buns on the grill."
        },
        {
          "step6": "Spread the remaining barbecue sauce on the toasted buns, add the cheesy patties, and assemble your burgers."
        },
        {
          "step7": "Serve your zesty barbecue cheeseburgers hot and enjoy!"
        }
      ]
    },
    {
      "items": [
        "Chuck Roast",
        "Ranch Salad Dressing Mix",
        "Italian Dressing Mix"
      ],
      "recipeName": "Beef Pot Roast",
      "ingredients": [
        "1 boneless beef chuck roast (about 3 pounds)",
        "1 packet (1 ounce) dry ranch dressing mix",
        "1 packet (.7 ounces) dry Italian salad dressing mix",
        "1 packet (.7 ounces) dry Italian salad dressing mix"
      ],
      "websiteLink": "https://30seconds.com/food/tip/47218/Grandmas-4-Ingredient-Beef-Pot-Roast-Recipe-Has-Stood-the-Test-of-Time",
      "steps": [
        {
          "step1": "Preheat your oven to 325°F (163°C)."
        },
        {
          "step2": "Place the boneless beef chuck roast in a roasting pan."
        },
        {
          "step3": "Sprinkle the dry ranch dressing mix evenly over the roast."
        },
        {
          "step4": "Follow by sprinkling both packets of dry Italian salad dressing mix over the roast."
        },
        {
          "step5": "Cover the roasting pan with a lid or aluminum foil."
        },
        {
          "step6": "Bake the roast in the preheated oven for about 3 hours or until the meat is tender and can be easily shredded with a fork."
        },
        {
          "step7": "Once done, shred the beef with two forks, and it's ready to serve."
        },
        {
          "step8": "Enjoy your delicious and tender beef pot roast!"
        }
      ]
    },
    {
      "items": [
        "Casserole Steak",
        "Cream of Condensed Mushroom Soup",
        "Beef Oxo",
        "Onion",
        "Mashed Potato",
        "Mixed Veggies"
      ],
      "recipeName": "Beef Casserole",
      "ingredients": [
        "500gm casserole steak, chopped into 2cm cubes",
        "1 tin of cream of mushroom soup",
        "2 beef oxos",
        "1 large onion, halved and roughly chopped",
        "Mashed potato and veggies to serve"
      ],
      "websiteLink": "https://mumslounge.com.au/lifestyle/food/4-ingredient-beef-casserole-recipe/",
      "steps": [
        {
          "step1": "Preheat your oven to 180°C (356°F)."
        },
        {
          "step2": "In a casserole dish, combine the chopped casserole steak, cream of mushroom soup, beef oxos, and chopped onion."
        },
        {
          "step3": "Mix everything together until well combined."
        },
        {
          "step4": "Cover the casserole dish and place it in the preheated oven. Bake for 2-2.5 hours, or until the steak is tender and the flavors have melded together."
        },
        {
          "step5": "Serve the beef casserole over mashed potatoes and veggies. Enjoy your delicious and hearty meal!"
        }
      ]
    },
    {
      "items": [
        "Ground Beef",
        "Mushroom",
        "Pasta Sauce",
        "Russet Potato",
        "Parmesan Cheese"
      ],
      "recipeName": "Meat Sauce Topped Baked Potato",
      "ingredients": [
        "2 ounces lean ground beef",
        "⅓ cup sliced mushrooms",
        "3 tablespoons light pasta sauce, such as Heart Smart",
        "1 6-ounce russet potato, baked",
        "1 tablespoon grated Parmesan cheese"
      ],
      "websiteLink": "https://www.eatingwell.com/recipe/259434/marinara-meat-sauce-topped-baked-potato/",
      "steps": [
        {
          "step1": "In a skillet, cook the lean ground beef until browned, breaking it into crumbles as it cooks."
        },
        {
          "step2": "Add the sliced mushrooms to the skillet and cook until they're tender and the beef is fully cooked."
        },
        {
          "step3": "Stir in the light pasta sauce and let it simmer for a few minutes to heat through."
        },
        {
          "step4": "Cut the baked russet potato open and fluff the inside with a fork."
        },
        {
          "step5": "Spoon the meat sauce mixture over the baked potato, and sprinkle with grated Parmesan cheese. Enjoy your delicious meat sauce topped baked potato!"
        }
      ]
    },
    {
      "items": [
        "Beef Steak",
        "Romaine Lettuce",
        "Parmesan Cheese",
        "Hoagie Rolls",
        "Caesar Dressing"
      ],
      "recipeName": "Caesar Steak Sandwiches",
      "ingredients": [
        "1 pound beef Top Sirloin Boneless or Top Round Steak, cut 3/4 inch thick or Flank Steak",
        "2 cups coarsely chopped romaine lettuce",
        "1/4 cup shredded Parmesan cheese",
        "4 hoagie rolls (6 inches long each), split, toasted",
        "1/2 cup prepared non-creamy Caesar dressing"
      ],
      "websiteLink": "https://www.beefitswhatsfordinner.com/recipes/recipe/1406/caesar-steak-sandwiches",
      "steps": [
        {
          "step1": "Preheat your grill to medium heat (about 350-400°F or 175-200°C)."
        },
        {
          "step2": "Season the beef steak with salt and pepper to taste."
        },
        {
          "step3": "Grill the steak over direct heat for about 6-7 minutes per side for medium-rare or until desired doneness is reached."
        },
        {
          "step4": "Remove the steak from the grill and let it rest for a few minutes. After resting, slice the steak into thin strips."
        },
        {
          "step5": "To assemble the sandwiches, spread non-creamy Caesar dressing on the toasted hoagie rolls. Layer with romaine lettuce, grilled steak slices, and shredded Parmesan cheese. Serve immediately and enjoy your Caesar Steak Sandwiches!"
        }
      ]
    },
    {
      "items": ["Ketchup", "Honey", "Soy Sauce", "Garlic", "Pork Chop"],
      "recipeName": "Honey Garlic Pork Chops",
      "ingredients": [
        "1/2 cup ketchup",
        "2 2/3 tablespoons honey",
        "2 tablespoons low-sodium soy sauce",
        "2 cloves garlic, crushed",
        "6 (4 ounce) (1-inch thick) pork chops"
      ],
      "websiteLink": "https://www.allrecipes.com/recipe/235158/worlds-best-honey-garlic-pork-chops/",
      "steps": [
        {
          "step1": "In a small bowl, mix together ketchup, honey, low-sodium soy sauce, and crushed garlic."
        },
        {
          "step2": "Preheat your grill to medium-high heat."
        },
        {
          "step3": "Lightly oil the grill grate and place the pork chops on the grill."
        },
        {
          "step4": "Brush the pork chops with the honey garlic sauce and cook for about 6-7 minutes per side or until the internal temperature reaches 145°F (63°C)."
        },
        {
          "step5": "Serve the honey garlic pork chops with the remaining sauce as a glaze. Enjoy your delicious meal!"
        }
      ]
    },
    {
      "items": [
        "Potato",
        "Pork Fillet",
        "Sage",
        "Cheddar Cheese",
        "Prosciutto"
      ],
      "recipeName": "Pork & Mash Gratin",
      "ingredients": [
        "800 g potatoes",
        "400 g piece of higher-welfare pork fillet",
        "2 sprigs of fresh sage",
        "40 g Cheddar cheese",
        "4 slices of higher-welfare prosciutto"
      ],
      "websiteLink": "https://www.jamieoliver.com/recipes/pork-recipes/pork-mash-gratin/",
      "steps": [
        {
          "step1": "Preheat your oven to 180°C/350°F/gas 4."
        },
        {
          "step2": "Peel and thinly slice the potatoes, and finely slice the fresh sage."
        },
        {
          "step3": "Cut the pork fillet into 1cm/0.4-inch slices, then bash them to 0.5cm/0.2-inch thick."
        },
        {
          "step4": "Layer the sliced potatoes in a baking dish, seasoning with salt, pepper, and half of the sage as you go."
        },
        {
          "step5": "Place the pork slices on top of the potatoes, and put a slice of prosciutto on each piece. Sprinkle over the Cheddar cheese and the remaining sage. Cover with foil and bake for 45 minutes. Remove the foil and bake for an additional 15 minutes or until the top is golden and the pork is cooked through. Serve and enjoy!"
        }
      ]
    },
    {
      "items": ["Pork", "Flour", "Sake", "Ginger", "Ginger Sauce"],
      "recipeName": "Ginger Pork (Shogayaki)",
      "ingredients": [
        "Thinly sliced pork",
        "Flour",
        "Sake",
        "Ginger",
        "Ginger Sauce"
      ],
      "websiteLink": "https://www.justonecookbook.com/ginger-pork-shogayaki/",
      "steps": [
        {
          "step1": "Slice the ginger into thin strips."
        },
        {
          "step2": "In a bowl, mix together the ginger sauce ingredients: 2 tablespoons sake, 2 tablespoons soy sauce, 1 tablespoon mirin, and 1 tablespoon sugar. Set aside."
        },
        {
          "step3": "Lightly coat the thinly sliced pork with flour."
        },
        {
          "step4": "Heat a pan over medium heat and add a bit of oil. Cook the pork slices until they are no longer pink."
        },
        {
          "step5": "Pour the ginger sauce over the cooked pork slices and add the ginger strips. Stir-fry for a couple of minutes until the sauce thickens. Serve your delicious Ginger Pork (Shogayaki) over steamed rice and enjoy!"
        }
      ]
    },
    {
      "items": [
        "Hoisin Sauce",
        "Ketchup",
        "Sriracha Chili Sauce",
        "Pork Spare Ribs",
        "Sea Salt"
      ],
      "recipeName": "Sticky Ribs",
      "ingredients": [
        "1/2 cup hoisin",
        "1/2 cup ketchup",
        "1/2 cup sriracha chilli sauce (or any spicy sauce you prefer)",
        "1kg (2 lb) rack of pork spare ribs, cut into individual ribs",
        "Sea salt"
      ],
      "websiteLink": "https://www.marionskitchen.com/4-ingredient-sticky-ribs/",
      "steps": [
        {
          "step1": "Cut the rack of pork spare ribs into individual ribs. This makes them easier to handle during cooking."
        },
        {
          "step2": "Lightly season the ribs with sea salt to enhance their flavor."
        },
        {
          "step3": "In a bowl, combine the hoisin sauce, ketchup, and sriracha chilli sauce (or your preferred spicy sauce). Mix them together thoroughly to create the sticky sauce."
        },
        {
          "step4": "Generously coat each rib with the sticky sauce. Ensure that every rib is evenly covered."
        },
        {
          "step5": "Place the sauced ribs in a large resealable plastic bag or a covered container. Allow them to marinate in the refrigerator for at least 1-2 hours, or overnight for the best flavor. Preheat your grill to medium-high heat, ensuring the grates are clean and lightly oiled to prevent sticking."
        },
        {
          "step6": "Grill the marinated ribs for about 20-30 minutes, turning them occasionally. Baste the ribs with any remaining sauce as they cook. The ribs are ready when they're cooked through and have a nice caramelized coating."
        },
        {
          "step7": "Transfer the sticky ribs to a serving platter. You can garnish them with some extra sauce for dipping if desired. These delicious sticky ribs are perfect for a barbecue or as a flavorful appetizer. Enjoy!"
        }
      ]
    },
    {
      "items": [
        "Kosher Salt",
        "Black Pepper",
        "Italian Seasoning",
        "Rosemary Sprigs",
        "Pork Tenderloin"
      ],
      "recipeName": "Roasted Pork Tenderloin",
      "ingredients": [
        "Kosher salt",
        "Black pepper",
        "Italian seasoning",
        "Rosemary sprigs (optional)",
        "Pork Tenderloin"
      ],
      "websiteLink": "https://www.iheartnaptime.net/pork-tenderloin/",
      "steps": [
        {
          "step1": "Preheat your oven to 425°F (220°C)."
        },
        {
          "step2": "Season the pork tenderloin generously with kosher salt, black pepper, and Italian seasoning. You can also add fresh rosemary sprigs for additional flavor, if desired."
        },
        {
          "step3": "Place the seasoned pork tenderloin in a roasting pan or on a baking sheet."
        },
        {
          "step4": "Roast the pork tenderloin in the preheated oven for about 20-25 minutes or until the internal temperature reaches 145°F (63°C)."
        },
        {
          "step5": "Once the pork is cooked to your desired level of doneness, remove it from the oven and let it rest for a few minutes before slicing. Serve the roasted pork tenderloin with your favorite side dishes and enjoy!"
        }
      ]
    },
    {
      "items": [
        "Pork Loin",
        "Egg",
        "Bread Crumbs",
        "Parmesan Cheese",
        "Lemon Wedges"
      ],
      "recipeName": "Parmesan Crusted Pork Chops",
      "ingredients": [
        "Boneless pork loin chops",
        "Egg",
        "Bread crumbs",
        "Parmesan cheese",
        "Lemon wedges"
      ],
      "websiteLink": "https://sweetphi.com/5-ingredient-parmesan-crusted-pork-chops/",
      "steps": [
        {
          "step1": "Preheat your oven to 375°F (190°C)."
        },
        {
          "step2": "In a shallow bowl, beat the egg."
        },
        {
          "step3": "In another shallow bowl, combine the bread crumbs and grated Parmesan cheese."
        },
        {
          "step4": "Dip each pork chop into the beaten egg, allowing excess to drip off, then coat it with the breadcrumb-Parmesan mixture, pressing it onto the pork to adhere."
        },
        {
          "step5": "Place the coated pork chops on a baking sheet and bake in the preheated oven for about 25-30 minutes or until the pork is cooked through and the coating is golden and crispy. Serve with lemon wedges for extra flavor. Enjoy your Parmesan Crusted Pork Chops!"
        }
      ]
    },
    {
      "items": ["Pork Chop", "Garlic", "Rosemary Sprigs", "Peach", "Bourbon"],
      "recipeName": "Peachy Pork Chops",
      "ingredients": [
        "2 x 250 g higher-welfare pork chops , with rind",
        "4 cloves of garlic",
        "2 sprigs of fresh rosemary",
        "1 x 410 g tin of peach halves in juice",
        "50 ml bourbon"
      ],
      "websiteLink": "https://www.jamieoliver.com/recipes/pork-recipes/peachy-pork-chops/",
      "steps": [
        {
          "step1": "Preheat your oven to 200°C/180°C fan/gas 6 (392°F/356°F fan)."
        },
        {
          "step2": "Place the pork chops in a large ovenproof pan and sear them over high heat until golden brown on both sides."
        },
        {
          "step3": "Add the minced garlic and rosemary sprigs to the pan and cook for a minute until fragrant."
        },
        {
          "step4": "Pour in the peach halves with their juice and bourbon. Season with salt and pepper. Bring the mixture to a boil."
        },
        {
          "step5": "Transfer the pan to the preheated oven and roast for about 25-30 minutes until the pork is cooked through, and the sauce has thickened. Serve the peachy pork chops with the delicious sauce. Enjoy your meal!"
        }
      ]
    },
    {
      "items": [
        "Chicken Stock",
        "Brown Sugar",
        "Chili Powder",
        "Smoked Paprika",
        "Pork Shoulder Roast"
      ],
      "recipeName": "Pulled Pork",
      "ingredients": [
        "180 ml (3/4 cup) of chicken stock",
        "30 ml (2 tbsp) of brown sugar",
        "15 ml (1 tbsp) of chili powder",
        "15 ml (1 tbsp) of smoked paprika",
        "1.5 kg (3 1/3 lb.) of pork shoulder roast, bone-in"
      ],
      "websiteLink": "https://www.5ingredients15minutes.com/en/recipes/main-course/pork/pulled-pork/",
      "steps": [
        {
          "step1": "Preheat your oven to 150°C (300°F)."
        },
        {
          "step2": "In a small bowl, mix together the brown sugar, chili powder, and smoked paprika to create a dry rub."
        },
        {
          "step3": "Rub the dry spice mixture all over the pork shoulder roast, ensuring it's well coated."
        },
        {
          "step4": "Place the seasoned pork roast in a roasting pan and pour the chicken stock around it."
        },
        {
          "step5": "Cover the pan with foil and roast in the preheated oven for 4-5 hours, or until the pork is tender and falls apart easily. Once done, shred the pork using two forks. Serve as a delicious pulled pork dish."
        }
      ]
    },
    {
      "items": [
        "Crackers",
        "Onion Seasoning",
        "Ketchup",
        "Bourbon",
        "Meatloaf"
      ],
      "recipeName": "National Conference Meatloaf",
      "ingredients": [
        "1 cup crushed buttery rounds crackers",
        "5 tablespoons Onion Onion™ Seasoning",
        "1/4 cup ketchup",
        "3 tablespoons Bayou Bourbon™ Glaze",
        "1 1/2 pounds ground meatloaf mixture (beef, pork)"
      ],
      "websiteLink": "https://www.tastefullysimple.com/recipes/2009-national-conference-meatloaf/",
      "steps": [
        {
          "step1": "Preheat your oven to 350°F (175°C)."
        },
        {
          "step2": "In a large mixing bowl, combine the crushed buttery rounds crackers and Onion Onion™ Seasoning."
        },
        {
          "step3": "Add the ketchup and Bayou Bourbon™ Glaze to the cracker mixture and mix until well combined."
        },
        {
          "step4": "Add the ground meatloaf mixture to the bowl and mix until all the ingredients are evenly incorporated."
        },
        {
          "step5": "Place the meatloaf mixture into a greased loaf pan and bake in the preheated oven for about 1 hour or until the meatloaf is cooked through. Let it rest for a few minutes before slicing and serving."
        }
      ]
    },
    {
      "items": [
        "Pork Chop",
        "Flour",
        "Mango Chutney",
        "Dijon Mustard",
        "Chicken Broth"
      ],
      "recipeName": "Pork Chops with Chutney Sauce",
      "ingredients": [
        "4 1 1/4 pounds bone-in center-cut pork loin pork chops",
        "1 tablespoon all-purpose flour",
        "1/3 cup mango chutney",
        "1 tablespoon dijon mustard",
        "1 cup fat-free low-sodium chicken broth"
      ],
      "websiteLink": "https://thehealthycookingblog.com/easy-pork-chops1/",
      "steps": [
        {
          "step1": "Start by seasoning the pork chops with salt and pepper. Dredge each chop in all-purpose flour."
        },
        {
          "step2": "In a large skillet, heat some oil over medium-high heat. Add the pork chops and cook for about 4-5 minutes per side, or until they're nicely browned and cooked through. Remove the chops from the skillet and set them aside."
        },
        {
          "step3": "In the same skillet, add mango chutney, dijon mustard, and fat-free low-sodium chicken broth. Stir well and bring the mixture to a simmer."
        },
        {
          "step4": "Return the pork chops to the skillet and let them simmer in the sauce for an additional 5-7 minutes, ensuring they are heated through."
        },
        {
          "step5": "Serve the pork chops with the chutney sauce drizzled over the top. Enjoy!"
        }
      ]
    },
    {
      "items": [
        "White Fish Fillet",
        "Olive Oil",
        "Butter",
        "Lemon",
        "Garlic Paste"
      ],
      "recipeName": "Baked Fish with Lemon Butter Sauce",
      "ingredients": [
        "2 4-ounce white fish fillets",
        "1 tablespoon olive oil",
        "1/3 cup butter",
        "1 lemon",
        "1 teaspoon garlic paste"
      ],
      "websiteLink": "https://www.furtherfood.com/recipe/baked-fish-with-lemon-butter-sauce-keto-low-carb-gluten-free-quick-easy-fish-dish/",
      "steps": [
        {
          "step1": "Preheat your oven to 375°F (190°C)."
        },
        {
          "step2": "Place the white fish fillets on a baking sheet. Drizzle them with olive oil and season with salt and pepper."
        },
        {
          "step3": "Bake the fish in the preheated oven for about 15-20 minutes or until they are cooked through and easily flake with a fork."
        },
        {
          "step4": "While the fish is baking, prepare the lemon butter sauce. In a saucepan, melt the butter over low heat. Squeeze the juice of one lemon into the melted butter, and add the garlic paste. Stir well and let it simmer for a couple of minutes."
        },
        {
          "step5": "Once the fish is done baking, drizzle the lemon butter sauce over the fillets. Serve immediately, and enjoy your baked fish with a delicious lemon butter sauce!"
        }
      ]
    },
    {
      "items": [
        "Octopus",
        "White Beans",
        "Parsley",
        "Olive Oil",
        "Lemon Wedges"
      ],
      "recipeName": "Octopus with Beans",
      "ingredients": [
        "1 (3-4 Pound) Octopus",
        "1 (14 Ounce) Can White Beans",
        "Chopped Fresh Parsley",
        "Extra Virgin Olive Oil",
        "Lemon Wedges"
      ],
      "websiteLink": "https://www.italianfoodforever.com/2017/05/octopus-with-white-beans/",
      "steps": [
        {
          "step1": "Start by cleaning and preparing the octopus. You can ask your fishmonger to clean it for you or follow an online guide for cleaning and prepping octopus."
        },
        {
          "step2": "In a large pot, bring water to a boil. Once boiling, reduce the heat to a simmer, and add the cleaned octopus. Cook the octopus for about 1-2 hours or until it is tender. The cooking time can vary depending on the size and tenderness of the octopus."
        },
        {
          "step3": "While the octopus is cooking, in a separate pan, warm the white beans. You can use canned white beans for convenience."
        },
        {
          "step4": "Once the octopus is tender, remove it from the pot and let it cool slightly. Then, cut it into bite-sized pieces."
        },
        {
          "step5": "In a serving platter, arrange the white beans and the octopus pieces. Drizzle extra virgin olive oil over the dish and garnish with chopped fresh parsley. Serve with lemon wedges on the side. Enjoy your delicious Octopus with Beans!"
        }
      ]
    },
    {
      "items": ["Mussel", "Butter", "Garlic", "Lemon Juice", "Parsley"],
      "recipeName": "Mussels with Garlic Stuffing",
      "ingredients": [
        "4 pints (2.25 litres) cleaned mussels",
        "4 oz (110 g) butter, at room temperature",
        "3 cloves garlic, crushed",
        "1 tablespoon lemon juice",
        "1 heaped tablespoon chopped parsley"
      ],
      "websiteLink": "https://www.deliaonline.com/recipes/international/european/french/mussels-with-garlic-stuffing",
      "steps": [
        {
          "step1": "Start by preheating your grill to high heat."
        },
        {
          "step2": "In a bowl, mix the softened butter, crushed garlic, lemon juice, and chopped parsley to create the garlic stuffing."
        },
        {
          "step3": "Place the cleaned mussels on a baking tray and top each mussel with a small amount of the garlic stuffing mixture."
        },
        {
          "step4": "Place the mussels under the grill for about 3-5 minutes or until the garlic stuffing is bubbling and lightly browned."
        },
        {
          "step5": "Serve the mussels with garlic stuffing immediately, and enjoy your delicious seafood dish!"
        }
      ]
    },
    {
      "items": ["Shrimp", "Salted Egg", "Garlic", "Onion", "Butter"],
      "recipeName": "Salted Egg Shrimp",
      "ingredients": ["Shrimp", "Salted Egg", "Garlic", "Onion", "Butter"],
      "websiteLink": "https://www.kawalingpinoy.com/salted-egg-shrimp/",
      "steps": [
        {
          "step1": "Peel and devein the shrimp, leaving the tails on. Rinse and pat dry with paper towels."
        },
        {
          "step2": "In a pan, melt the butter over medium heat. Add minced garlic and diced onions. Sauté until the onions are translucent."
        },
        {
          "step3": "While the garlic and onions are cooking, mash the salted egg yolks into a fine paste."
        },
        {
          "step4": "Add the mashed salted egg yolks to the pan and stir to combine with the garlic and onions."
        },
        {
          "step5": "Add the cleaned shrimp to the pan and cook until they turn pink and are coated with the salted egg mixture. Serve hot and enjoy your delicious Salted Egg Shrimp!"
        }
      ]
    },
    {
      "items": ["Shrimp", "Mussel", "Pasta", "Pasta Sauce", "Garlic"],
      "recipeName": "Seafood Pasta",
      "ingredients": ["Shrimp", "Mussel", "Pasta", "Pasta Sauce", "Garlic"],
      "websiteLink": "https://tastesbetterfromscratch.com/seafood-pasta/",
      "steps": [
        {
          "step1": "Cook the pasta according to the package instructions until it's al dente. Drain and set aside."
        },
        {
          "step2": "In a large skillet, heat some olive oil over medium heat. Add minced garlic and sauté for a minute or until fragrant."
        },
        {
          "step3": "Add the shrimp to the skillet and cook until they turn pink, about 2-3 minutes per side."
        },
        {
          "step4": "Add the mussels and pasta sauce to the skillet. Cover and simmer until the mussels open, about 5 minutes."
        },
        {
          "step5": "Toss the cooked pasta with the seafood and sauce. Serve hot and enjoy your delicious Seafood Pasta!"
        }
      ]
    },
    {
      "items": ["Tuna", "Prawn", "Onion", "Tomato", "Calamansi Juice"],
      "recipeName": "Seafood Kebab",
      "ingredients": [
        "1/2 kilo fresh tuna cut into big cubes",
        "1/2 kilo prawns shelled and deveined",
        "3 large onions quartered",
        "3 large tomatoes quartered",
        "Juice of 1 lemon or juice of 5 pcs calamansi juice"
      ],
      "websiteLink": "https://www.panlasangpinoymeatrecipes.com/seafood-kebab.htm",
      "steps": [
        {
          "step1": "In a bowl, combine the fresh tuna cubes, prawns, and the calamansi juice (or lemon juice). Allow them to marinate for about 30 minutes."
        },
        {
          "step2": "Thread the marinated seafood, quartered onions, and tomatoes onto skewers, alternating the ingredients to your preference."
        },
        {
          "step3": "Preheat a grill to medium-high heat. You can also use a stovetop grill pan."
        },
        {
          "step4": "Grill the seafood kebabs for about 3-4 minutes on each side or until the seafood is cooked through and has grill marks."
        },
        {
          "step5": "Serve your delicious seafood kebabs hot. You can accompany them with your favorite dipping sauce or side dishes. Enjoy!"
        }
      ]
    },
    {
      "items": ["Shrimp", "Squid", "Mussel", "Green Onion", "Soy Sauce"],
      "recipeName": "Mixed Seafood Stir",
      "ingredients": [
        "Shrimp",
        "Squid",
        "Mussel",
        "Spring Onions",
        "Soy Sauce"
      ],
      "websiteLink": "https://www.etfoodvoyage.com/ginger-garlic-seafood-stir-fry/",
      "steps": [
        {
          "step1": "Prepare the seafood: Clean and devein the shrimp. Clean the squid and slice it into rings. Rinse the mussels thoroughly."
        },
        {
          "step2": "In a large wok or skillet, heat a bit of cooking oil over high heat. Add the prepared seafood and stir-fry for about 2-3 minutes until they turn pink and opaque. Remove the seafood from the wok and set it aside."
        },
        {
          "step3": "In the same wok, add a bit more cooking oil. Add the chopped spring onions and stir-fry for a minute until they become fragrant and slightly tender."
        },
        {
          "step4": "Return the cooked seafood to the wok with the spring onions. Add soy sauce and continue to stir-fry for another 2-3 minutes to combine the flavors."
        },
        {
          "step5": "Serve your delicious mixed seafood stir-fry hot over steamed rice or noodles. Garnish with additional spring onions, if desired, and enjoy!"
        }
      ]
    },
    {
      "items": [
        "Flour",
        "Evaporated Milk",
        "Tuna",
        "Green Onion",
        "Bread Crumbs"
      ],
      "recipeName": "Comforting Tuna Patties",
      "ingredients": [
        "3 tablespoons all-purpose flour",
        "1 cup evaporated milk",
        "1 pouch (6.4 ounces) light tuna in water",
        "1 green onion, finely chopped",
        "1/3 cup plus 1/2 cup dry bread crumbs, divided"
      ],
      "websiteLink": "https://www.tasteofhome.com/recipes/comforting-tuna-patties/",
      "steps": [
        {
          "step1": "In a mixing bowl, combine 3 tablespoons of all-purpose flour and 1 cup of evaporated milk. Mix until you have a smooth batter."
        },
        {
          "step2": "Add 1 pouch of light tuna in water to the batter. Mix until the tuna is well incorporated."
        },
        {
          "step3": "Stir in 1 finely chopped green onion into the mixture."
        },
        {
          "step4": "Gradually add 1/3 cup of dry bread crumbs to the mixture and stir until it thickens. If the mixture is too wet, you can add more bread crumbs until you achieve a consistency that can be shaped into patties."
        },
        {
          "step5": "Shape the mixture into patties, coat them with the remaining 1/2 cup of dry bread crumbs, and then fry them in a pan until they're golden brown on both sides. Drain on paper towels and serve hot."
        }
      ]
    },
    {
      "items": ["Rice", "Pineapple", "Lime", "Vegetables", "Shrimp"],
      "recipeName": "Thai Pineapple Fried Rice",
      "ingredients": ["Rice", "Pineapple", "Lime", "Vegetables", "Shrimp"],
      "websiteLink": "https://shelfcooking.com/pineapple-rice/",
      "steps": [
        {
          "step1": "Cook 2 cups of rice according to package instructions and allow it to cool."
        },
        {
          "step2": "In a large pan or wok, heat some oil over medium heat. Add 1 cup of cooked and peeled shrimp and stir-fry until they turn pink. Remove the shrimp from the pan and set them aside."
        },
        {
          "step3": "In the same pan, add diced vegetables of your choice, such as bell peppers, carrots, and peas. Stir-fry until they start to soften."
        },
        {
          "step4": "Add the cooked rice to the pan with the vegetables. Stir-fry and toss the rice to combine it with the vegetables."
        },
        {
          "step5": "Add 2 cups of diced pineapple, the cooked shrimp, and the juice of one lime to the pan. Stir-fry for a few more minutes until everything is heated through and well mixed. Serve your delicious Thai pineapple fried rice hot."
        }
      ]
    },
    {
      "items": ["Tuna", "Pasta", "Pasta Sauce", "Garlic", "Tomato"],
      "recipeName": "Tuna Pasta",
      "ingredients": ["Tuna", "Pasta", "Pasta Sauce", "Garlic", "Tomato"],
      "websiteLink": "https://feelgoodfoodie.net/recipe/tuna-pasta/",
      "steps": [
        {
          "step1": "Cook your favorite pasta according to the package instructions. Drain and set aside."
        },
        {
          "step2": "In a large pan, heat some olive oil over medium heat. Add minced garlic and sauté for a minute or until fragrant."
        },
        {
          "step3": "Add diced tomatoes to the pan and cook for a few minutes until they start to soften."
        },
        {
          "step4": "Stir in a can of tuna and pasta sauce of your choice. Simmer for about 5-7 minutes until the sauce is heated through."
        },
        {
          "step5": "Combine the cooked pasta with the tuna and tomato sauce in the pan. Toss everything together until well mixed. Serve your delicious tuna pasta hot, and you can garnish it with fresh herbs or grated Parmesan cheese if you like."
        }
      ]
    }
  ]
}
